-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/czh/Documents/ECON 490/Econometric file/Econometric File.log
  log type:  text
 opened on:  16 Apr 2022, 19:50:18

. *start log file
. *Tianrun Mao #74184029 Yuan Ma #49022585 Catherine Cai #52204310 Wataru 15925928 
> Econometric
. clear all

. *changing directory
. *cd "C:\Users\KL\OneDrive\桌面\ECON490\Econometric"
. cd "/Users/czh/Documents/ECON 490/Econometric file"
/Users/czh/Documents/ECON 490/Econometric file

. 
. 
. clear

. 
. wbopendata, language(en - English) country() topics() indicator(TM.TAX.MRCH.SM.AR
> .ZS;TT.PRI.MRCH.XD.WD;BM.KLT.DINV.CD.WD;NE.TRD.GNFS.ZS;NY.GNS.ICTR.ZS;NY.GDP.PETR
> .RT.ZS) clear long

    Metadata for indicator TM.TAX.MRCH.SM.AR.ZS
-----------------------------------------------------------------------------------
    Name: Tariff rate, applied, simple mean, all products (%)
-----------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-----------------------------------------------------------------------------------
    Description: Simple mean applied tariff is the unweighted average of
    effectively applied rates for all products subject to tariffs calculated
    for all traded goods. Data are classified using the Harmonized System of
    trade at the six- or eight-digit level. Tariff line data were matched to
    Standard International Trade Classification (SITC) revision 3 codes to
    define commodity groups. Effectively applied tariff rates at the six- and
    eight-digit product level are averaged for products in each commodity
    group. When the effectively applied rate is unavailable, the most favored
    nation rate is used instead. To the extent possible, specific rates have
    been converted to their ad valorem equivalent rates and have been included
    in the calculation of simple mean tariffs.
-----------------------------------------------------------------------------------
    Note: World Bank staff estimates using the World Integrated Trade Solution
    system, based on data from United Nations Conference on Trade and
    Development's Trade Analysis and Information System (TRAINS) database and
    the World Trade Organization’s (WTO) Integrated Data Base (IDB) and
    Consolidated Tariff Schedules (CTS) database.
-----------------------------------------------------------------------------------
    Topic(s): 12 Private Sector ; 21 Trade
-----------------------------------------------------------------------------------



    Metadata for indicator TT.PRI.MRCH.XD.WD
-----------------------------------------------------------------------------------
    Name: Net barter terms of trade index (2000 = 100)
-----------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-----------------------------------------------------------------------------------
    Description: Net barter terms of trade index is calculated as the
    percentage ratio of the export unit value indexes to the import unit value
    indexes, measured relative to the base year 2000. Unit value indexes are
    based on data reported by countries that demonstrate consistency under
    UNCTAD quality controls, supplemented by UNCTAD's estimates using the
    previous year’s trade values at the Standard International Trade
    Classification three-digit level as weights. To improve data coverage,
    especially for the latest periods, UNCTAD constructs a set of average
    prices indexes at the three-digit product classification of the Standard
    International Trade Classification revision 3 using UNCTAD’s Commodity
    Price Statistics, interna­tional and national sources, and UNCTAD
    secretariat estimates and calculates unit value indexes at the country
    level using the current year's trade values as weights.
-----------------------------------------------------------------------------------
    Note: United Nations Conference on Trade and Development, Handbook of
    Statistics and data files, and International Monetary Fund, International
    Financial Statistics.
-----------------------------------------------------------------------------------
    Topic(s): 12 Private Sector ; 21 Trade
-----------------------------------------------------------------------------------



    Metadata for indicator BM.KLT.DINV.CD.WD
-----------------------------------------------------------------------------------
    Name: Foreign direct investment, net outflows (BoP, current US$)
-----------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-----------------------------------------------------------------------------------
    Description: Foreign direct investment refers to direct investment equity
    flows in an economy. It is the sum of equity capital, reinvestment of
    earnings, and other capital. Direct investment is a category of
    cross-border investment associated with a resident in one economy having
    control or a significant degree of influence on the management of an
    enterprise that is resident in another economy. Ownership of 10 percent or
    more of the ordinary shares of voting stock is the criterion for
    determining the existence of a direct investment relationship. This series
    shows net outflows of investment from the reporting economy to the rest of
    the world. Data are in current U.S. dollars.
-----------------------------------------------------------------------------------
    Note: International Monetary Fund, Balance of Payments database,
    supplemented by data from the United Nations Conference on Trade and
    Development and official national sources.
-----------------------------------------------------------------------------------
    Topic(s): 3 Economy and Growth ; 7 Financial Sector
-----------------------------------------------------------------------------------



    Metadata for indicator NE.TRD.GNFS.ZS
-----------------------------------------------------------------------------------
    Name: Trade (% of GDP)
-----------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-----------------------------------------------------------------------------------
    Description: Trade is the sum of exports and imports of goods and services
    measured as a share of gross domestic product.
-----------------------------------------------------------------------------------
    Note: World Bank national accounts data, and OECD National Accounts data
    files.
-----------------------------------------------------------------------------------
    Topic(s): 3 Economy and Growth ; 21 Trade
-----------------------------------------------------------------------------------



    Metadata for indicator NY.GNS.ICTR.ZS
-----------------------------------------------------------------------------------
    Name: Gross savings (% of GDP)
-----------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-----------------------------------------------------------------------------------
    Description: Gross savings are calculated as gross national income less
    total consumption, plus net transfers.
-----------------------------------------------------------------------------------
    Note: World Bank national accounts data, and OECD National Accounts data
    files.
-----------------------------------------------------------------------------------
    Topic(s): 3 Economy and Growth
-----------------------------------------------------------------------------------



    Metadata for indicator NY.GDP.PETR.RT.ZS
-----------------------------------------------------------------------------------
    Name: Oil rents (% of GDP)
-----------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-----------------------------------------------------------------------------------
    Description: Oil rents are the difference between the value of crude oil
    production at regional prices and total costs of production.
-----------------------------------------------------------------------------------
    Note: World Bank staff estimates based on sources and methods described in
    the World Bank's The Changing Wealth of Nations.
-----------------------------------------------------------------------------------
    Topic(s): 5 Energy and Mining ; 6 Environment
-----------------------------------------------------------------------------------



. rename tm_tax_mrch_sm_ar_zs tariff

. rename tt_pri_mrch_xd_wd tot

. rename bm_klt_dinv_cd_wd fdiout

. rename ne_trd_gnfs_zs tropen

. rename ny_gns_ictr_zs saving

. rename ny_gdp_petr_rt_zs oilprofit

. rename countryname country

. 
. replace country = "Lao People's DR" if country == "Lao PDR"
(62 real changes made)

. replace country = "Viet Nam" if country == "Vietnam"
(62 real changes made)

. replace country = "Gambia" if country == "Gambia, The"
(62 real changes made)

. replace country = "Iran (Islamic Republic of)" if country == "Iran, Islamic Rep"
(62 real changes made)

. replace country = "Slovakia" if country == "Slovak Republic"
(62 real changes made)

. replace country = "Bolivia (Plurinational State of)" if country == "Bolivia"
(62 real changes made)

. replace country = "Republic of Moldova" if country == "Moldova"
(62 real changes made)

. replace country = "Kyrgyzstan" if country == "Kyrgyz Republic"
(62 real changes made)

. replace country = "St. Vincent and the Grenadines" if country == "St Vincent and 
> the Grenadines"
(62 real changes made)

. replace country = "Republic of Korea" if country == "Korea, Rep"
(62 real changes made)

. replace country = "Congo" if country == "Congo, Rep"
(62 real changes made)

. replace country = "D.R. of the Congo" if country == "Congo, Dem Rep"
(62 real changes made)

. replace country = "Côte d'Ivoire" if country == "Cote d'Ivoire"
(62 real changes made)

. replace country = "China, Macao SAR" if country == "Macao SAR, China"
(62 real changes made)

. replace country = "Venezuela (Bolivarian Republic of)" if country == "Venezuela, 
> RB"
(62 real changes made)

. replace country = "Egypt" if country == "Egypt, Arab Rep"
(62 real changes made)

. replace country = "Yemen" if country == "Yemen, Rep"
(62 real changes made)

. replace country = "Bahamas" if country == "Bahamas, The"
(62 real changes made)

. replace country = "Saint Lucia" if country == "St Lucia"
(62 real changes made)

. replace country = "U.R. of Tanzania: Mainland" if country == "Tanzania"
(62 real changes made)

. replace country = "Curaçao" if country == "Curacao"
(62 real changes made)

. replace country = "China, Hong Kong SAR" if country == "Hong Kong SAR, China"
(62 real changes made)

. save wbdata, replace
(file wbdata.dta not found)
file wbdata.dta saved

. 
. clear

. use "pwt100.dta"

. 
. merge 1:1 country year using wbdata
(variable country was str34, now str56 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         7,942
        from master                     2,130  (_merge==1)
        from using                      5,812  (_merge==2)

    Matched                            10,680  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(7,942 observations deleted)

. keep countrycode country cgdpe year tropen pop hc fdiout tot tariff saving csh_x 
> oilprofit

. encode country, generate(code)

. xtset code year, yearly

Panel variable: code (strongly balanced)
 Time variable: year, 1960 to 2019
         Delta: 1 year

. gen gdp=(cgdpe/pop)
(1,206 missing values generated)

. gen lngdp=ln(gdp)
(1,206 missing values generated)

. label variable lngdp "Natural log of GDP per capita"

. gen grpop = ln(pop)-ln(L1.pop)
(1,384 missing values generated)

. label variable grpop "year-on-year growth rate of the population"

. gen lnhc = ln(hc)
(2,746 missing values generated)

. label variable lnhc "Natural log of index of human capital"

. gen lntropen=ln(tropen)
(3,191 missing values generated)

. gen lnsaving=ln(abs(saving))
(5,394 missing values generated)

. replace lnsaving = -lnsaving if saving < 0
(92 real changes made)

. gen lntot=ln(tot)
(5,544 missing values generated)

. gen lntariff=ln(tariff)
(7,242 missing values generated)

. gen lnfdiout=ln(abs(fdiout))
(5,456 missing values generated)

. replace lnfdiout = -lnfdiout if fdiout < 0
(733 real changes made)

. 
. save final, replace
(file final.dta not found)
file final.dta saved

. 
. * Citations: 
. * Feenstra, Robert C., Robert Inklaar and Marcel P. Timmer (2015), 
. * "The Next Generation of the Penn World Table" American Economic Review, 
. * 105(10), 3150-3182, available for download at www.ggdc.net/pwt.
. 
. * The World Bank, World Development Indicators (2022). Tariff rate, applied, 
. * simple mean, all products (%) [Data file]. 
. * Retrieved from https://data.worldbank.org/indicator/TM.TAX.MRCH.SM.AR.ZS
. 
. * The World Bank, World Development Indicators (2022). Net barter terms of 
. * trade index (2000 = 100) [Data file]. 
. * Retrieved from http://data.worldbank.org/indicator/TT.PRI.MRCH.XD.WD
. 
. * The World Bank, World Development Indicators (2022). Foreign direct 
. * investment, net outflows (BoP, current US$) [Data file]. 
. * Retrieved from https://data.worldbank.org/indicator/BM.KLT.DINV.CD.WD
. 
. * The World Bank, World Development Indicators (2022). Trade (% of GDP)
. * [Data file]. Retrieved from http://data.worldbank.org/indicator/NE.TRD.GNFS.ZS
. 
. * The World Bank, World Development Indicators (2022). Gross savings (% of GDP)
. * [Data file]. Retrieved from http://data.worldbank.org/indicator/NY.GNS.ICTR.ZS
. 
. * The World Bank, World Development Indicators (2022). Oil rents (% of GDP) 
. * [Data file]. Retrieved from http://data.worldbank.org/indicator/NY.GDP.PETR.RT.
> ZS
. 
. 
. 
. 
. *Comment for our data:
. * Since there are different naming convensions, I renamed all of them and
. * merge it afterward, the matched obersvation improved from 9360
. * to 10680.
. * Since FDI net outflow will encounter negative value, we taking the absolute
. * value of the FDI outflow and taking natural log of it, later on we change
. * the sign of the lnfdiout if the original FDI net outflow is negative.
. * Same thing done to saving.
. * Regarding for the concern of ln(0)=1, the STATA will ignore the variables
. * if the tariff is zero, therefore it will be a ignored value.
. 
. 
. 
. *2 reports for all variables for one year 
. sum cgdpe pop gdp grpop tot saving hc csh_x tariff fdiout tropen if year==2017

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       cgdpe |        178    664433.8     2253405   794.7381   1.98e+07
         pop |        178    41.52015    150.6975    .029577   1421.022
         gdp |        178    22113.07    22278.18   381.1562   110697.8
       grpop |        178    .0128142    .0118509  -.0214061   .0467805
         tot |        176    117.7897    34.03321   50.72248   265.3916
-------------+---------------------------------------------------------
      saving |        152    22.73048    9.498759    -1.7466   55.33646
          hc |        144    2.658237    .6945273   1.211936   3.974208
       csh_x |        178    .2912458    .3326641   .0045398   2.654966
      tariff |        118    5.597627    4.311975          0       19.9
      fdiout |        164    1.28e+10    4.66e+10  -1.45e+10   4.09e+11
-------------+---------------------------------------------------------
      tropen |        164     89.8151    58.12199   1.462385   376.8278

. 
. *1. Variable TOT
. *check non linearity
. quietly reg lngdp lntot lnsaving grpop lnhc L1.lngdp i.year, cluster(code)

. acprplot lntot, lowess lsopts(bwidth(1))

. graph export nonlinear1.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/nonlinear1.png saved as PNG
    format

. *The graph indicate there is non linearity
. gen lntot2=lntot^2
(5,544 missing values generated)

. reg lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year, cluster(code)

Linear regression                               Number of obs     =      3,687
                                                F(45, 138)        =   33927.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9974
                                                Root MSE          =     .06227

                                 (Std. err. adjusted for 139 clusters in code)
------------------------------------------------------------------------------
             |               Robust
       lngdp | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lntot |   .3300222   .1036808     3.18   0.002     .1250138    .5350305
      lntot2 |  -.0330043   .0105079    -3.14   0.002    -.0537816    -.012227
    lnsaving |   .0107577   .0041902     2.57   0.011     .0024724     .019043
       grpop |  -.4118953    .192315    -2.14   0.034    -.7921605   -.0316301
        lnhc |   .0423546   .0113168     3.74   0.000     .0199777    .0647314
             |
       lngdp |
         L1. |   .9843331    .002467   399.00   0.000     .9794551     .989211
             |
        year |
       1981  |  -.0053272   .0115234    -0.46   0.645    -.0281125    .0174581
       1982  |  -.0345171   .0149502    -2.31   0.022    -.0640782    -.004956
       1983  |   -.019551   .0121098    -1.61   0.109    -.0434957    .0043937
       1984  |  -.0091008   .0124663    -0.73   0.467    -.0337505    .0155489
       1985  |   .0002682   .0143622     0.02   0.985    -.0281303    .0286666
       1986  |  -.0323595   .0216489    -1.49   0.137    -.0751658    .0104469
       1987  |  -.0263554   .0133305    -1.98   0.050    -.0527139    3.06e-06
       1988  |  -.0206923   .0141617    -1.46   0.146    -.0486942    .0073097
       1989  |  -.0161092   .0123159    -1.31   0.193    -.0404614     .008243
       1990  |  -.0182215   .0136544    -1.33   0.184    -.0452203    .0087773
       1991  |  -.0065249   .0117872    -0.55   0.581    -.0298318    .0167821
       1992  |  -.0231432   .0149115    -1.55   0.123    -.0526278    .0063414
       1993  |  -.0165101   .0130505    -1.27   0.208    -.0423149    .0092947
       1994  |   .0008154   .0149717     0.05   0.957    -.0287882    .0304189
       1995  |   .0073845   .0141506     0.52   0.603    -.0205955    .0353644
       1996  |   .0196293   .0127551     1.54   0.126    -.0055914    .0448499
       1997  |  -.0239628   .0119323    -2.01   0.047    -.0475566    -.000369
       1998  |  -.0424335   .0129867    -3.27   0.001    -.0681122   -.0167548
       1999  |  -.0153569    .010998    -1.40   0.165    -.0371031    .0063894
       2000  |   .0060994   .0105244     0.58   0.563    -.0147106    .0269094
       2001  |  -.0152572   .0115438    -1.32   0.188    -.0380828    .0075685
       2002  |  -.0035794   .0114275    -0.31   0.755     -.026175    .0190161
       2003  |   .0012468   .0114013     0.11   0.913    -.0212971    .0237908
       2004  |   .0221171   .0106668     2.07   0.040     .0010256    .0432085
       2005  |   .0414228    .010867     3.81   0.000     .0199354    .0629102
       2006  |   .0267509   .0112433     2.38   0.019     .0045194    .0489824
       2007  |   .0183213   .0118749     1.54   0.125    -.0051591    .0418016
       2008  |   .0166186   .0111652     1.49   0.139    -.0054584    .0386955
       2009  |   -.042792   .0141111    -3.03   0.003    -.0706939     -.01489
       2010  |     .03445   .0110357     3.12   0.002     .0126291    .0562709
       2011  |    .037658   .0114726     3.28   0.001     .0149731    .0603428
       2012  |   -.005154   .0114722    -0.45   0.654    -.0278381      .01753
       2013  |  -.0241344   .0113492    -2.13   0.035    -.0465753   -.0016935
       2014  |  -.0197374    .011785    -1.67   0.096      -.04304    .0035651
       2015  |   -.029696   .0135872    -2.19   0.031     -.056562   -.0028301
       2016  |  -.0202159   .0114944    -1.76   0.081    -.0429439    .0025121
       2017  |   .0015324   .0110542     0.14   0.890     -.020325    .0233898
       2018  |  -.0107834   .0108916    -0.99   0.324    -.0323194    .0107526
       2019  |  -.0200308   .0109829    -1.82   0.070    -.0417474    .0016858
             |
       _cons |  -.7058889   .2510341    -2.81   0.006    -1.202259   -.2095184
------------------------------------------------------------------------------

. *We see the coefficietns on lntot2 is siginifcant, indicate a good fit of our mod
> el
. 
. *fe
. xtreg lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp, fe

Fixed-effects (within) regression               Number of obs     =      3,687
Group variable: code                            Number of groups  =        139

R-squared:                                      Obs per group:
     Within  = 0.9683                                         min =          1
     Between = 0.9993                                         avg =       26.5
     Overall = 0.9968                                         max =         40

                                                F(6,3542)         =   18027.81
corr(u_i, Xb) = 0.7264                          Prob > F          =     0.0000

------------------------------------------------------------------------------
       lngdp | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lntot |   .2057036   .0687913     2.99   0.003      .070829    .3405783
      lntot2 |  -.0173888   .0071841    -2.42   0.016    -.0314741   -.0033035
    lnsaving |   .0125122   .0021132     5.92   0.000      .008369    .0166555
       grpop |  -.4546788   .2395539    -1.90   0.058    -.9243563    .0149987
        lnhc |   .1494914   .0139816    10.69   0.000     .1220786    .1769043
             |
       lngdp |
         L1. |   .9354629   .0042217   221.58   0.000     .9271856    .9437402
             |
       _cons |   -.123817   .1694172    -0.73   0.465    -.4559821    .2083481
-------------+----------------------------------------------------------------
     sigma_u |  .04749667
     sigma_e |   .0630241
         rho |  .36222611   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(138, 3542) = 3.40                   Prob > F = 0.0000

. 
. *test for year fix effect
. quietly xtreg lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year, fe

. testparm i.year

 ( 1)  1981.year = 0
 ( 2)  1982.year = 0
 ( 3)  1983.year = 0
 ( 4)  1984.year = 0
 ( 5)  1985.year = 0
 ( 6)  1986.year = 0
 ( 7)  1987.year = 0
 ( 8)  1988.year = 0
 ( 9)  1989.year = 0
 (10)  1990.year = 0
 (11)  1991.year = 0
 (12)  1992.year = 0
 (13)  1993.year = 0
 (14)  1994.year = 0
 (15)  1995.year = 0
 (16)  1996.year = 0
 (17)  1997.year = 0
 (18)  1998.year = 0
 (19)  1999.year = 0
 (20)  2000.year = 0
 (21)  2001.year = 0
 (22)  2002.year = 0
 (23)  2003.year = 0
 (24)  2004.year = 0
 (25)  2005.year = 0
 (26)  2006.year = 0
 (27)  2007.year = 0
 (28)  2008.year = 0
 (29)  2009.year = 0
 (30)  2010.year = 0
 (31)  2011.year = 0
 (32)  2012.year = 0
 (33)  2013.year = 0
 (34)  2014.year = 0
 (35)  2015.year = 0
 (36)  2016.year = 0
 (37)  2017.year = 0
 (38)  2018.year = 0
 (39)  2019.year = 0

       F( 39,  3503) =   11.45
            Prob > F =    0.0000

. **The score is 10.35 where we reject the null hypothesis that coefficietns 
. *on dummies for year is equal to 0. Therefore we need to include
. *year fixed effect
. 
. *test Heteroskedasticity
. quietly xtreg lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year, fe

. xttest3

Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

H0: sigma(i)^2 = sigma^2 for all i

chi2 (139)  =  53802.52
Prob>chi2 =      0.0000


. *The result is 48270 and we reject the null hypothesis that this model
. *is homoskedasticity, therefore the residuals are heteroskedastic.
. 
. quietly xtreg lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year, fe

. predict r, rstudent
(6,993 missing values generated)

. quietly xtreg lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year if oilprofit
> >=0.1, fe

. predict r1, rstudent
(6,993 missing values generated)

. sort r

. list r country year tot if abs(r)>3 & r!=.

       +-----------------------------------------------------------------+
       |         r                              country   year       tot |
       |-----------------------------------------------------------------|
    1. | -10.36845                              Nigeria   1986   70.2703 |
    2. | -7.357166   Venezuela (Bolivarian Republic of)   2014    398.96 |
    3. | -6.687095                                Congo   1986   66.6667 |
    4. | -6.649866                              Nigeria   1987   72.6027 |
    5. | -6.214168                                Congo   1992   61.0169 |
       |-----------------------------------------------------------------|
    6. | -6.143291                              Nigeria   1994   56.1224 |
    7. | -5.948735                                 Iraq   2015    121.49 |
    8. | -5.821711                                Niger   1984   227.451 |
    9. | -5.598395                                Congo   2015   173.707 |
   10. | -5.059402                              Nigeria   1993   59.4059 |
       |-----------------------------------------------------------------|
   11. | -5.051462                              Myanmar   2012   107.801 |
   12. | -5.000528                                Benin   1982   93.4211 |
   13. |  -4.66431                               Angola   2000       100 |
   14. | -4.618938                               Jordan   1990   93.6842 |
   15. | -4.613508                                Congo   2007   179.117 |
       |-----------------------------------------------------------------|
   16. | -4.473094                              Nigeria   1988   60.9375 |
   17. | -4.384974                                 Togo   1993   90.4762 |
   18. | -4.359005                           Tajikistan   2015   83.3462 |
   19. | -4.328165                              Nigeria   1983   155.172 |
   20. | -4.299375                               Gambia   2011   102.915 |
       |-----------------------------------------------------------------|
   21. | -4.209891                                Haiti   2010   218.064 |
   22. | -4.186285                                Sudan   2012   236.652 |
   23. | -4.166447                                 Mali   1988    128.44 |
   24. | -4.059172                                Congo   2016   164.898 |
   25. | -4.041166                              Nigeria   1991   74.3902 |
       |-----------------------------------------------------------------|
   26. | -4.023363                               Kuwait   2015   121.773 |
   27. | -3.997886                               Angola   2009   164.394 |
   28. | -3.993133                              Burundi   1995   163.569 |
   29. | -3.925717                                Congo   1998      39.2 |
   30. | -3.922232                                 Peru   1989   119.149 |
       |-----------------------------------------------------------------|
   31. | -3.761338                                Haiti   2017   265.392 |
   32. | -3.711729                              Burundi   1996   118.943 |
   33. |  -3.66195                                 Togo   1981   122.727 |
   34. | -3.617069                                Congo   2009   150.243 |
   35. | -3.587831                              Nigeria   1995   55.5556 |
       |-----------------------------------------------------------------|
   36. | -3.556117                              Burundi   2005   107.534 |
   37. | -3.544714                                 Togo   1998   114.851 |
   38. | -3.531302                              Nigeria   1989   75.7143 |
   39. | -3.518187                                 Mali   2004   114.223 |
   40. | -3.500991                                Gabon   2009   160.291 |
       |-----------------------------------------------------------------|
   41. |  -3.47884                          El Salvador   1981   74.7368 |
   42. | -3.478291                              Nigeria   1984   154.545 |
   43. |  -3.47527                              Burundi   2000       100 |
   44. | -3.446388                                Haiti   2008   228.693 |
   45. |  -3.41481                          El Salvador   1980   93.9759 |
       |-----------------------------------------------------------------|
   46. | -3.413602                              Nigeria   1982   163.636 |
   47. | -3.398449                                 Mali   1987   126.852 |
   48. | -3.374842                                Benin   1994    80.531 |
   49. | -3.368352                                 Mali   1992   113.333 |
   50. | -3.357512                    D.R. of the Congo   2008   132.556 |
       |-----------------------------------------------------------------|
   51. | -3.325712                           Madagascar   2002   86.4279 |
   52. |  -3.26035                                Ghana   1982       125 |
   53. | -3.254024                              Burundi   1993   120.408 |
   54. | -3.245937                    D.R. of the Congo   2017   116.148 |
   55. | -3.227233                              Nigeria   1996   86.9048 |
       |-----------------------------------------------------------------|
   56. | -3.192724                                Niger   2004   117.418 |
   57. | -3.185709                                Haiti   1994   110.588 |
   58. | -3.174672                                Gabon   1986   142.105 |
   59. | -3.147194                           Kyrgyzstan   2005   106.742 |
   60. | -3.074013                           Tajikistan   2008   96.0064 |
       |-----------------------------------------------------------------|
   61. | -3.055799                                Congo   1994   53.5714 |
   62. | -3.010317                           Mozambique   2010   104.161 |
   63. | -3.007644                                 Togo   2000       100 |
 3640. |  3.008385                            Singapore   2005   86.3704 |
 3641. |   3.11954                             Paraguay   2002   135.653 |
       |-----------------------------------------------------------------|
 3642. |  3.139724                              Iceland   2008   87.9314 |
 3643. |  3.139741                            Singapore   2010   84.1566 |
 3644. |  3.143617                             Botswana   1986   82.6667 |
 3645. |  3.161189                     China, Macao SAR   2006   89.9591 |
 3646. |  3.179761                               Kuwait   2018    152.15 |
       |-----------------------------------------------------------------|
 3647. |  3.209721                     China, Macao SAR   2009   85.7089 |
 3648. |  3.316776                              Nigeria   1985   143.478 |
 3649. |  3.354619                    Brunei Darussalam   2008   256.131 |
 3650. |  3.387682                     China, Macao SAR   2012   86.0992 |
 3651. |  3.403161                            Singapore   2004   87.6657 |
       |-----------------------------------------------------------------|
 3652. |  3.431125                                Gabon   2000       100 |
 3653. |  3.438071                    Brunei Darussalam   2005   159.991 |
 3654. |   3.45943                             Botswana   1989   102.247 |
 3655. |  3.503658                              Bahrain   2003   96.9843 |
 3656. |  3.545216                            Singapore   2000       100 |
       |-----------------------------------------------------------------|
 3657. |  3.546347                 Syrian Arab Republic   2004   107.659 |
 3658. |  3.630596                         Sierra Leone   2013   57.7439 |
 3659. |  3.639118                            Argentina   1996       100 |
 3660. |  3.658813                     China, Macao SAR   2007   87.1773 |
 3661. |  3.685818                               Angola   2010   195.961 |
       |-----------------------------------------------------------------|
 3662. |   3.69572                    Brunei Darussalam   2011   223.364 |
 3663. |  3.714444                         Saudi Arabia   2010   120.789 |
 3664. |  3.748408                              Ireland   2019   91.6557 |
 3665. |  3.810975                     China, Macao SAR   2013   85.5622 |
 3666. |  3.818135                               Kuwait   2006   156.085 |
       |-----------------------------------------------------------------|
 3667. |  3.847905                                Congo   2010   173.057 |
 3668. |  4.127079                               Kuwait   2004   119.526 |
 3669. |  4.180435                               Kuwait   2011   194.406 |
 3670. |   4.19898                              Bahrain   2005   125.798 |
 3671. |  4.222334                              Myanmar   2013   108.651 |
       |-----------------------------------------------------------------|
 3672. |  4.238673                               Kuwait   2003   100.978 |
 3673. |   4.30393                     China, Macao SAR   2004   94.8565 |
 3674. |  4.315499                         Saudi Arabia   2008   148.203 |
 3675. |   4.75215                                Gabon   1989   136.842 |
 3676. |  4.833059                                Gabon   2005   154.994 |
       |-----------------------------------------------------------------|
 3677. |  4.934204                              Bahrain   2000       100 |
 3678. |  4.985676                         Saudi Arabia   2011   148.267 |
 3679. |  4.992667                 Syrian Arab Republic   2005   126.389 |
 3680. |  5.025364                               Kuwait   2005   139.686 |
 3681. |  5.101817                     China, Macao SAR   2011   86.4374 |
       |-----------------------------------------------------------------|
 3682. |  5.162995                     China, Macao SAR   2010   86.9216 |
 3683. |  5.412822                                Congo   2000       100 |
 3684. |  5.990617                                Qatar   2011   213.837 |
 3685. |  6.378902                              Nigeria   2005    156.29 |
 3686. |  6.847862                              Ireland   2015   96.6819 |
       |-----------------------------------------------------------------|
 3687. |   8.61735                             Zimbabwe   2009   97.6818 |
       +-----------------------------------------------------------------+

. sort r1

. list r1 country year tot if abs(r1)>3 & r1!=.

       +-----------------------------------------------------------------+
       |        r1                              country   year       tot |
       |-----------------------------------------------------------------|
    1. | -8.659224                              Nigeria   1986   70.2703 |
    2. |  -6.14493                              Nigeria   1987   72.6027 |
    3. | -6.113294   Venezuela (Bolivarian Republic of)   2014    398.96 |
    4. | -5.786617                              Nigeria   1994   56.1224 |
    5. | -5.758596                                Congo   1992   61.0169 |
       |-----------------------------------------------------------------|
    6. | -5.581432                                Niger   1984   227.451 |
    7. | -5.134511                                Congo   1986   66.6667 |
    8. | -5.107414                              Nigeria   1993   59.4059 |
    9. | -4.896925                              Myanmar   2012   107.801 |
   10. | -4.836349                                 Iraq   2015    121.49 |
       |-----------------------------------------------------------------|
   11. | -4.793613                                Congo   2015   173.707 |
   12. | -4.677035                               Angola   2000       100 |
   13. | -4.622519                               Jordan   1990   93.6842 |
   14. | -4.619357                                Congo   2007   179.117 |
   15. | -4.593744                                Haiti   2010   218.064 |
       |-----------------------------------------------------------------|
   16. | -4.464272                               Gambia   2011   102.915 |
   17. | -4.360762                              Burundi   2005   107.534 |
   18. | -4.345732                                Benin   1982   93.4211 |
   19. | -4.252598                                 Togo   1993   90.4762 |
   20. | -4.171502                              Burundi   1995   163.569 |
       |-----------------------------------------------------------------|
   21. |  -4.12226                              Nigeria   1983   155.172 |
   22. | -4.073915                              Nigeria   1991   74.3902 |
   23. | -4.064698                                Sudan   2012   236.652 |
   24. | -3.994451                    D.R. of the Congo   2008   132.556 |
   25. | -3.949615                           Tajikistan   2015   83.3462 |
       |-----------------------------------------------------------------|
   26. | -3.933411                                 Mali   2004   114.223 |
   27. | -3.900815                                Haiti   2017   265.392 |
   28. | -3.867863                                 Mali   1988    128.44 |
   29. |  -3.86168                              Nigeria   1988   60.9375 |
   30. | -3.850018                              Burundi   1996   118.943 |
       |-----------------------------------------------------------------|
   31. | -3.832867                                 Togo   1981   122.727 |
   32. | -3.818722                    D.R. of the Congo   2017   116.148 |
   33. | -3.817247                                Niger   2004   117.418 |
   34. | -3.797239                                Congo   2016   164.898 |
   35. |  -3.78265                                 Peru   1989   119.149 |
       |-----------------------------------------------------------------|
   36. | -3.771066                              Nigeria   1996   86.9048 |
   37. | -3.736629                          El Salvador   1980   93.9759 |
   38. |  -3.72545                    D.R. of the Congo   2011   120.228 |
   39. | -3.723986                              Nigeria   1995   55.5556 |
   40. | -3.721844                           Kyrgyzstan   2005   106.742 |
       |-----------------------------------------------------------------|
   41. | -3.700296                              Burundi   2000       100 |
   42. | -3.679436                           Tajikistan   2008   96.0064 |
   43. | -3.670304                              Lesotho   1980       131 |
   44. |  -3.62797                                 Mali   1992   113.333 |
   45. | -3.605332                              Burundi   2017   179.445 |
       |-----------------------------------------------------------------|
   46. | -3.605192                                Haiti   2008   228.693 |
   47. | -3.564812                              Burundi   2006    119.67 |
   48. | -3.562861                              Burundi   1993   120.408 |
   49. | -3.562106                           Mozambique   2010   104.161 |
   50. | -3.557909                              Burundi   2018   162.766 |
       |-----------------------------------------------------------------|
   51. | -3.550625                              Nigeria   1989   75.7143 |
   52. | -3.544459                              Burundi   2011   181.272 |
   53. | -3.535984                                Niger   2011   188.528 |
   54. | -3.515265                          El Salvador   1981   74.7368 |
   55. | -3.500965                               Angola   2009   164.394 |
       |-----------------------------------------------------------------|
   56. | -3.497897                    D.R. of the Congo   2006   117.962 |
   57. | -3.453771                              Nigeria   1984   154.545 |
   58. | -3.385149                                Congo   2009   150.243 |
   59. | -3.345809                           Madagascar   2002   86.4279 |
   60. |  -3.33956                                 Mali   1987   126.852 |
       |-----------------------------------------------------------------|
   61. | -3.326361                                 Togo   2000       100 |
   62. | -3.317676                           Mozambique   2011   102.509 |
   63. | -3.310606                              Burundi   2007   119.644 |
   64. |  -3.30886                                 Togo   1998   114.851 |
   65. | -3.264516                         Sierra Leone   2005   75.7784 |
       |-----------------------------------------------------------------|
   66. | -3.252721                           Tajikistan   2018   99.8907 |
   67. | -3.229819                               Uganda   2012   111.339 |
   68. | -3.225361                                Niger   2000       100 |
   69. | -3.213665                               Uganda   1996   157.658 |
   70. | -3.204281                              Burundi   2012   176.206 |
       |-----------------------------------------------------------------|
   71. |  -3.19936                              Nigeria   1990   88.5057 |
   72. | -3.196692                                 Togo   2007   100.969 |
   73. | -3.167595                    D.R. of the Congo   2005   106.685 |
   74. | -3.132587             Central African Republic   1980   260.606 |
   75. | -3.128541                               Zambia   2012   190.754 |
       |-----------------------------------------------------------------|
   76. | -3.105278                           Kyrgyzstan   2002   105.584 |
   77. | -3.103043                                 Togo   2006   96.1652 |
   78. | -3.101912                                Benin   1994    80.531 |
   79. | -3.100484                                Benin   2010   127.373 |
   80. | -3.087713                           Mozambique   2017   102.174 |
       |-----------------------------------------------------------------|
   81. | -3.087327                              Burundi   2010   166.958 |
   82. | -3.081047                           Tajikistan   2005   96.2026 |
   83. | -3.080274                              Burundi   1989     177.5 |
   84. | -3.079924                                 Mali   1990   134.783 |
   85. | -3.066953                               Uganda   1995    197.17 |
       |-----------------------------------------------------------------|
   86. | -3.066682           U.R. of Tanzania: Mainland   2017   168.898 |
   87. | -3.061817           U.R. of Tanzania: Mainland   1992        98 |
   88. | -3.046436                               Zambia   2017   184.199 |
   89. | -3.045198                                Niger   2007   220.765 |
   90. | -3.029233                                 Togo   2010   112.192 |
       |-----------------------------------------------------------------|
   91. | -3.026867           U.R. of Tanzania: Mainland   2012   155.331 |
 3639. |   3.00691                              Nigeria   1985   143.478 |
 3640. |  3.067904                    Republic of Korea   2015   59.0268 |
 3641. |   3.07825                              Ireland   2016   97.7655 |
 3642. |  3.113531                               Brazil   1986   73.3871 |
       |-----------------------------------------------------------------|
 3643. |  3.145039                                Malta   2015   138.255 |
 3644. |   3.14529                              Bahrain   2003   96.9843 |
 3645. |  3.176045                    Brunei Darussalam   2005   159.991 |
 3646. |   3.20209                           Luxembourg   2016   73.7701 |
 3647. |  3.244244                     China, Macao SAR   2006   89.9591 |
       |-----------------------------------------------------------------|
 3648. |  3.246527                               Kuwait   2018    152.15 |
 3649. |  3.273074                         Saudi Arabia   2010   120.789 |
 3650. |  3.305028                            Singapore   2000       100 |
 3651. |  3.320147                            Singapore   2004   87.6657 |
 3652. |  3.338151                            Argentina   1996       100 |
       |-----------------------------------------------------------------|
 3653. |  3.400466                              Iceland   2008   87.9314 |
 3654. |  3.402856                              Iceland   2015   88.0688 |
 3655. |  3.433196                    Brunei Darussalam   2008   256.131 |
 3656. |  3.453668                    Brunei Darussalam   2011   223.364 |
 3657. |  3.478483                           Luxembourg   2014   73.4594 |
       |-----------------------------------------------------------------|
 3658. |  3.498225                             Botswana   1986   82.6667 |
 3659. |  3.564714                              Bahrain   2005   125.798 |
 3660. |  3.618621                            Mauritius   1986    87.013 |
 3661. |  3.631513                     China, Macao SAR   2012   86.0992 |
 3662. |   3.67732                              Myanmar   2013   108.651 |
       |-----------------------------------------------------------------|
 3663. |  3.750326                           Luxembourg   2015   75.7499 |
 3664. |  3.785935                               Kuwait   2006   156.085 |
 3665. |  3.789306                               Kuwait   2011   194.406 |
 3666. |  3.806172                     China, Macao SAR   2009   85.7089 |
 3667. |  3.815835                 Syrian Arab Republic   2005   126.389 |
       |-----------------------------------------------------------------|
 3668. |  3.822161                     China, Macao SAR   2007   87.1773 |
 3669. |  3.927618                         Saudi Arabia   2008   148.203 |
 3670. |  3.946235                               Kuwait   2004   119.526 |
 3671. |  3.959749                                Gabon   2005   154.994 |
 3672. |  3.971826                              Ireland   2019   91.6557 |
       |-----------------------------------------------------------------|
 3673. |  4.001308                     China, Macao SAR   2004   94.8565 |
 3674. |  4.157907                     China, Macao SAR   2013   85.5622 |
 3675. |  4.210357                               Kuwait   2003   100.978 |
 3676. |   4.21778                         Sierra Leone   2013   57.7439 |
 3677. |  4.223053                                Congo   2000       100 |
       |-----------------------------------------------------------------|
 3678. |  4.307654                                Gabon   1989   136.842 |
 3679. |  4.405098                         Saudi Arabia   2011   148.267 |
 3680. |  4.405231                              Bahrain   2000       100 |
 3681. |  4.670391                               Kuwait   2005   139.686 |
 3682. |  4.948096                     China, Macao SAR   2011   86.4374 |
       |-----------------------------------------------------------------|
 3683. |  4.962221                     China, Macao SAR   2010   86.9216 |
 3684. |  5.165111                              Nigeria   2005    156.29 |
 3685. |  5.614077                                Qatar   2011   213.837 |
 3686. |  7.296851                              Ireland   2015   96.6819 |
 3687. |  8.093093                             Zimbabwe   2009   97.6818 |
       +-----------------------------------------------------------------+

. * The obersvation with r score greater then 3 is considered outlier and will
. * be ignored, the full list please see the list above.
. * For oil producing country, the outlier are siginifcant ar r1>=3, 10% of the obs
. * are outlier with r1 greater equal to 3, those will be excluded
. *test serial correlation
. xtserial lngdp lntot lntot2 lnsaving grpop lnhc

Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
    F(  1,     137) =    658.972
           Prob > F =      0.0000

. 
. *The test score is 658.9, and we reject the null hypothesis that there
. *is no serial correlation. And there is serial correlation presented in
. *this model
. 
. *test for collinearity
. collin lntot lnsaving grpop lnhc
(obs=3,687)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
     lntot      1.04    1.02    0.9648      0.0352
  lnsaving      1.12    1.06    0.8900      0.1100
     grpop      1.78    1.33    0.5619      0.4381
      lnhc      1.90    1.38    0.5255      0.4745
----------------------------------------------------
  Mean VIF      1.46

                           Cond
        Eigenval          Index
---------------------------------
    1     4.4968          1.0000
    2     0.4203          3.2709
    3     0.0448         10.0189
    4     0.0363         11.1374
    5     0.0019         48.9260
---------------------------------
 Condition Number        48.9260 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.5007

. *Since all the VIF is less then 10, we faile to reject the null hypothesis
. *then there is no evidence of multicollineary in this model
. 
. 
. quietly xtpcse lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year, het corr(a
> r1)

. 
. *3Variable TOT graph
. twoway (scatter lngdp lntot) (lfit lngdp lntot), title("Natural log of GDP per ca
> pita as a function of Natural log of TOT")

. graph export scatterlntot.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scatterlntot.png saved as PNG
    format

. twoway (scatter gdp tot) (lfit gdp tot), title("GDP per capita as a function of T
> OT")

. graph export scattertot.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scattertot.png saved as PNG
    format

. *5 all variables included
. xtpcse lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year if abs(r)<=3, het c
> orr(ar1) 

Number of gaps in sample = 84
note: computations for rho restarted at each gap.

Prais–Winsten regression, heteroskedastic panels corrected standard errors

Group variable:   code                          Number of obs     =      3,576
Time variable:    year                          Number of groups  =        139
Panels:           heteroskedastic (unbalanced)  Obs per group:
Autocorrelation:  common AR(1)                                min =          1
                                                              avg =  25.726619
                                                              max =         40
Estimated covariances      =       139          R-squared         =     0.9977
Estimated autocorrelations =         1          Wald chi2(45)     = 1049209.86
Estimated coefficients     =        46          Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |            Het-corrected
       lngdp | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lntot |   .1804493   .0779518     2.31   0.021     .0276666    .3332321
      lntot2 |  -.0168364   .0081986    -2.05   0.040    -.0329054   -.0007674
    lnsaving |   .0123778    .001977     6.26   0.000      .008503    .0162526
       grpop |  -.7089924   .1516751    -4.67   0.000     -1.00627   -.4117146
        lnhc |   .0443158   .0082253     5.39   0.000     .0281945     .060437
             |
       lngdp |
         L1. |   .9788891   .0020056   488.09   0.000     .9749583    .9828199
             |
        year |
       1981  |  -.0016319   .0085143    -0.19   0.848    -.0183195    .0150558
       1982  |  -.0257145   .0096745    -2.66   0.008    -.0446762   -.0067527
       1983  |  -.0172885    .009963    -1.74   0.083    -.0368156    .0022385
       1984  |  -.0019464   .0101196    -0.19   0.847    -.0217805    .0178877
       1985  |  -.0053395   .0100923    -0.53   0.597    -.0251201     .014441
       1986  |  -.0158311   .0099962    -1.58   0.113    -.0354234    .0037611
       1987  |  -.0191672   .0100764    -1.90   0.057    -.0389165    .0005821
       1988  |  -.0159456   .0100904    -1.58   0.114    -.0357225    .0038313
       1989  |  -.0219341   .0101967    -2.15   0.031    -.0419194   -.0019489
       1990  |  -.0157895   .0101294    -1.56   0.119    -.0356428    .0040638
       1991  |  -.0058454   .0100775    -0.58   0.562    -.0255969    .0139061
       1992  |  -.0154528   .0100432    -1.54   0.124    -.0351372    .0042316
       1993  |  -.0086001   .0101433    -0.85   0.397    -.0284806    .0112804
       1994  |   .0117512   .0099917     1.18   0.240    -.0078321    .0313345
       1995  |   .0112815   .0099624     1.13   0.257    -.0082444    .0308074
       1996  |   .0200225   .0099919     2.00   0.045     .0004388    .0396063
       1997  |  -.0241125   .0099731    -2.42   0.016    -.0436595   -.0045655
       1998  |  -.0356567   .0099295    -3.59   0.000    -.0551181   -.0161953
       1999  |    -.01402   .0099444    -1.41   0.159    -.0335108    .0054707
       2000  |   .0023256   .0089631     0.26   0.795    -.0152417    .0198929
       2001  |  -.0146685   .0090107    -1.63   0.104    -.0323293    .0029922
       2002  |  -.0040454   .0090326    -0.45   0.654    -.0217489    .0136581
       2003  |   -.001493   .0089694    -0.17   0.868    -.0190727    .0160866
       2004  |    .018835   .0089385     2.11   0.035     .0013157    .0363542
       2005  |   .0309078   .0088557     3.49   0.000      .013551    .0482645
       2006  |   .0251909   .0088449     2.85   0.004     .0078552    .0425266
       2007  |   .0197891   .0088389     2.24   0.025     .0024651     .037113
       2008  |    .014807   .0088433     1.67   0.094    -.0025255    .0321394
       2009  |  -.0413692   .0088166    -4.69   0.000    -.0586494   -.0240889
       2010  |   .0290834   .0088196     3.30   0.001     .0117973    .0463694
       2011  |   .0308906   .0087692     3.52   0.000     .0137033    .0480779
       2012  |  -.0024797   .0088189    -0.28   0.779    -.0197644    .0148051
       2013  |   -.028778    .008823    -3.26   0.001    -.0460708   -.0114852
       2014  |   -.016527   .0088431    -1.87   0.062    -.0338592    .0008051
       2015  |  -.0225804   .0088264    -2.56   0.011    -.0398799   -.0052809
       2016  |  -.0178436   .0088535    -2.02   0.044    -.0351961    -.000491
       2017  |   .0039629   .0088712     0.45   0.655    -.0134243    .0213501
       2018  |  -.0109723   .0088388    -1.24   0.214    -.0282961    .0063514
       2019  |  -.0203834   .0089111    -2.29   0.022    -.0378489    -.002918
             |
       _cons |  -.3137257   .1851291    -1.69   0.090    -.6765721    .0491208
-------------+----------------------------------------------------------------
         rho |   .3303397
------------------------------------------------------------------------------

. *predict quadratic graph 
. predict yhat, xb
(6,993 missing values generated)

. twoway (scatter yhat lntot) (qfit yhat lntot)

. graph export totqfit.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/totqfit.png saved as PNG
    format

. *6
. quietly eststo:xtpcse lngdp lntot i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lnsaving grpop i.year if abs(r)<=3, het 
> corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lnsaving grpop lnhc i.year if abs(r)<=3,
>  het corr(ar1)

. eststo:xtpcse lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year if abs(r)<=3
> , het corr(ar1)

Number of gaps in sample = 84
note: computations for rho restarted at each gap.

Prais–Winsten regression, heteroskedastic panels corrected standard errors

Group variable:   code                          Number of obs     =      3,576
Time variable:    year                          Number of groups  =        139
Panels:           heteroskedastic (unbalanced)  Obs per group:
Autocorrelation:  common AR(1)                                min =          1
                                                              avg =  25.726619
                                                              max =         40
Estimated covariances      =       139          R-squared         =     0.9977
Estimated autocorrelations =         1          Wald chi2(45)     = 1049209.86
Estimated coefficients     =        46          Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |            Het-corrected
       lngdp | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lntot |   .1804493   .0779518     2.31   0.021     .0276666    .3332321
      lntot2 |  -.0168364   .0081986    -2.05   0.040    -.0329054   -.0007674
    lnsaving |   .0123778    .001977     6.26   0.000      .008503    .0162526
       grpop |  -.7089924   .1516751    -4.67   0.000     -1.00627   -.4117146
        lnhc |   .0443158   .0082253     5.39   0.000     .0281945     .060437
             |
       lngdp |
         L1. |   .9788891   .0020056   488.09   0.000     .9749583    .9828199
             |
        year |
       1981  |  -.0016319   .0085143    -0.19   0.848    -.0183195    .0150558
       1982  |  -.0257145   .0096745    -2.66   0.008    -.0446762   -.0067527
       1983  |  -.0172885    .009963    -1.74   0.083    -.0368156    .0022385
       1984  |  -.0019464   .0101196    -0.19   0.847    -.0217805    .0178877
       1985  |  -.0053395   .0100923    -0.53   0.597    -.0251201     .014441
       1986  |  -.0158311   .0099962    -1.58   0.113    -.0354234    .0037611
       1987  |  -.0191672   .0100764    -1.90   0.057    -.0389165    .0005821
       1988  |  -.0159456   .0100904    -1.58   0.114    -.0357225    .0038313
       1989  |  -.0219341   .0101967    -2.15   0.031    -.0419194   -.0019489
       1990  |  -.0157895   .0101294    -1.56   0.119    -.0356428    .0040638
       1991  |  -.0058454   .0100775    -0.58   0.562    -.0255969    .0139061
       1992  |  -.0154528   .0100432    -1.54   0.124    -.0351372    .0042316
       1993  |  -.0086001   .0101433    -0.85   0.397    -.0284806    .0112804
       1994  |   .0117512   .0099917     1.18   0.240    -.0078321    .0313345
       1995  |   .0112815   .0099624     1.13   0.257    -.0082444    .0308074
       1996  |   .0200225   .0099919     2.00   0.045     .0004388    .0396063
       1997  |  -.0241125   .0099731    -2.42   0.016    -.0436595   -.0045655
       1998  |  -.0356567   .0099295    -3.59   0.000    -.0551181   -.0161953
       1999  |    -.01402   .0099444    -1.41   0.159    -.0335108    .0054707
       2000  |   .0023256   .0089631     0.26   0.795    -.0152417    .0198929
       2001  |  -.0146685   .0090107    -1.63   0.104    -.0323293    .0029922
       2002  |  -.0040454   .0090326    -0.45   0.654    -.0217489    .0136581
       2003  |   -.001493   .0089694    -0.17   0.868    -.0190727    .0160866
       2004  |    .018835   .0089385     2.11   0.035     .0013157    .0363542
       2005  |   .0309078   .0088557     3.49   0.000      .013551    .0482645
       2006  |   .0251909   .0088449     2.85   0.004     .0078552    .0425266
       2007  |   .0197891   .0088389     2.24   0.025     .0024651     .037113
       2008  |    .014807   .0088433     1.67   0.094    -.0025255    .0321394
       2009  |  -.0413692   .0088166    -4.69   0.000    -.0586494   -.0240889
       2010  |   .0290834   .0088196     3.30   0.001     .0117973    .0463694
       2011  |   .0308906   .0087692     3.52   0.000     .0137033    .0480779
       2012  |  -.0024797   .0088189    -0.28   0.779    -.0197644    .0148051
       2013  |   -.028778    .008823    -3.26   0.001    -.0460708   -.0114852
       2014  |   -.016527   .0088431    -1.87   0.062    -.0338592    .0008051
       2015  |  -.0225804   .0088264    -2.56   0.011    -.0398799   -.0052809
       2016  |  -.0178436   .0088535    -2.02   0.044    -.0351961    -.000491
       2017  |   .0039629   .0088712     0.45   0.655    -.0134243    .0213501
       2018  |  -.0109723   .0088388    -1.24   0.214    -.0282961    .0063514
       2019  |  -.0203834   .0089111    -2.29   0.022    -.0378489    -.002918
             |
       _cons |  -.3137257   .1851291    -1.69   0.090    -.6765721    .0491208
-------------+----------------------------------------------------------------
         rho |   .3303397
------------------------------------------------------------------------------
(est5 stored)

. esttab est1 est2 est3 est4 est5 using TOT.csv, star(* .10 ** .05 *** .01) se stat
> s(N r2) indicate("Year Dummies =*.year") replace
(file TOT.csv not found)
(output written to TOT.csv)

. 
. eststo:xtpcse lngdp lntot lntot2 lnsaving grpop lnhc L1.lngdp i.year if abs(r1)<=
> 3&oilprofit>=0.1, het corr(ar1)

Number of gaps in sample = 65
note: computations for rho restarted at each gap.

Prais–Winsten regression, heteroskedastic panels corrected standard errors

Group variable:   code                          Number of obs     =      1,563
Time variable:    year                          Number of groups  =         70
Panels:           heteroskedastic (unbalanced)  Obs per group:
Autocorrelation:  common AR(1)                                min =          1
                                                              avg =  22.328571
                                                              max =         40
Estimated covariances      =        70          R-squared         =     0.9974
Estimated autocorrelations =         1          Wald chi2(45)     =  294028.91
Estimated coefficients     =        46          Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |            Het-corrected
       lngdp | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lntot |   .2816547   .1264103     2.23   0.026      .033895    .5294144
      lntot2 |  -.0251383   .0131472    -1.91   0.056    -.0509063    .0006297
    lnsaving |   .0164009   .0034098     4.81   0.000     .0097177     .023084
       grpop |  -.9238807   .2659685    -3.47   0.001    -1.445169   -.4025919
        lnhc |   .0368613   .0129725     2.84   0.004     .0114356    .0622869
             |
       lngdp |
         L1. |   .9712211   .0031877   304.68   0.000     .9649734    .9774689
             |
        year |
       1981  |  -.0161821   .0125915    -1.29   0.199    -.0408609    .0084967
       1982  |  -.0658044   .0144361    -4.56   0.000    -.0940986   -.0375101
       1983  |  -.0315821   .0145659    -2.17   0.030    -.0601308   -.0030334
       1984  |  -.0156805    .014769    -1.06   0.288    -.0446273    .0132663
       1985  |  -.0328693   .0149257    -2.20   0.028    -.0621231   -.0036154
       1986  |  -.0704403   .0149802    -4.70   0.000    -.0998009   -.0410796
       1987  |  -.0294906   .0152418    -1.93   0.053     -.059364    .0003828
       1988  |  -.0443765     .01531    -2.90   0.004    -.0743835   -.0143695
       1989  |  -.0247408   .0152694    -1.62   0.105    -.0546683    .0051867
       1990  |  -.0133052   .0153198    -0.87   0.385    -.0433315     .016721
       1991  |  -.0106178   .0153583    -0.69   0.489    -.0407195     .019484
       1992  |   -.011651   .0153002    -0.76   0.446    -.0416388    .0183368
       1993  |  -.0082236   .0154107    -0.53   0.594     -.038428    .0219809
       1994  |  -.0057763   .0155723    -0.37   0.711    -.0362974    .0247449
       1995  |   .0056872   .0154172     0.37   0.712    -.0245299    .0359043
       1996  |   .0134534   .0155835     0.86   0.388    -.0170898    .0439965
       1997  |  -.0380575   .0156183    -2.44   0.015    -.0686689   -.0074461
       1998  |  -.0708747   .0159776    -4.44   0.000    -.1021903   -.0395591
       1999  |  -.0143859   .0156499    -0.92   0.358    -.0450592    .0162874
       2000  |   .0099808   .0139262     0.72   0.474    -.0173141    .0372758
       2001  |  -.0308914   .0142052    -2.17   0.030    -.0587332   -.0030497
       2002  |  -.0056502   .0142417    -0.40   0.692    -.0335634     .022263
       2003  |   .0012045   .0141441     0.09   0.932    -.0265175    .0289265
       2004  |   .0310118    .013961     2.22   0.026     .0036488    .0583748
       2005  |   .0350019   .0137091     2.55   0.011     .0081326    .0618712
       2006  |   .0227455   .0136541     1.67   0.096    -.0040161    .0495071
       2007  |   .0136143   .0136444     1.00   0.318    -.0131281    .0403568
       2008  |   .0128548   .0135625     0.95   0.343    -.0137271    .0394368
       2009  |     -.0635   .0137608    -4.61   0.000    -.0904706   -.0365294
       2010  |   .0421507   .0137484     3.07   0.002     .0152044    .0690971
       2011  |   .0348979    .013447     2.60   0.009     .0085422    .0612536
       2012  |  -.0054464   .0134032    -0.41   0.684    -.0317162    .0208233
       2013  |   -.043769   .0134781    -3.25   0.001    -.0701856   -.0173524
       2014  |  -.0397013   .0136228    -2.91   0.004    -.0664016    -.013001
       2015  |  -.0694575   .0139728    -4.97   0.000    -.0968437   -.0420713
       2016  |  -.0416065   .0140403    -2.96   0.003    -.0691249    -.014088
       2017  |  -.0004293   .0139389    -0.03   0.975     -.027749    .0268904
       2018  |  -.0198151   .0136699    -1.45   0.147    -.0466076    .0069775
       2019  |  -.0340966   .0137818    -2.47   0.013    -.0611085   -.0070847
             |
       _cons |  -.5290515   .3046131    -1.74   0.082    -1.126082    .0679793
-------------+----------------------------------------------------------------
         rho |   .3493105
------------------------------------------------------------------------------
(est6 stored)

. esttab est5 est6 using TOToil.csv, star(* .10 ** .05 *** .01) se stats(N r2) indi
> cate("Year Dummies =*.year") replace
(file TOToil.csv not found)
(output written to TOToil.csv)

. 
. 
. use final, clear

. *2. Variable Tariff
. *check non linearity
. quietly reg lngdp lntariff lnsaving grpop lnhc L1.lngdp i.year, cluster(code)

. acprplot lntariff, lowess lsopts(bwidth(1))

. graph export nonlinear2.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/nonlinear2.png saved as PNG
    format

. *The graph indicate there is no issue with non linearity
. 
. *fe
. quietly xtreg lngdp lntariff lnsaving grpop lnhc L1.lngdp, fe

. 
. *test for year fix effect
. quietly xtreg lngdp lntariff lnsaving grpop lnhc L1.lngdp i.year, fe

. testparm i.year

 ( 1)  1989.year = 0
 ( 2)  1990.year = 0
 ( 3)  1991.year = 0
 ( 4)  1992.year = 0
 ( 5)  1993.year = 0
 ( 6)  1994.year = 0
 ( 7)  1995.year = 0
 ( 8)  1996.year = 0
 ( 9)  1997.year = 0
 (10)  1998.year = 0
 (11)  1999.year = 0
 (12)  2000.year = 0
 (13)  2001.year = 0
 (14)  2002.year = 0
 (15)  2003.year = 0
 (16)  2004.year = 0
 (17)  2005.year = 0
 (18)  2006.year = 0
 (19)  2007.year = 0
 (20)  2008.year = 0
 (21)  2009.year = 0
 (22)  2010.year = 0
 (23)  2011.year = 0
 (24)  2012.year = 0
 (25)  2013.year = 0
 (26)  2014.year = 0
 (27)  2015.year = 0
 (28)  2016.year = 0
 (29)  2017.year = 0
 (30)  2018.year = 0
 (31)  2019.year = 0

       F( 31,  2514) =   14.74
            Prob > F =    0.0000

. **The score is 14.74 where we reject the null hypothesis that coefficietns 
. *on dummies for year is equal to 0. Therefore we need to include
. *year fixed effect
. 
. *test homoskedasticity
. quietly xtreg lngdp lntariff lnsaving grpop lnhc L1.lngdp, fe

. xttest3

Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

H0: sigma(i)^2 = sigma^2 for all i

chi2 (135)  =   6.2e+05
Prob>chi2 =      0.0000


. *The result is 620000 and we reject the null hypothesis that this model
. *is homoskedasticity, therefore the residuals are heteroskedastic.
. 
. * Outliers
. quietly xtreg lngdp lntariff lnsaving grpop lnhc L1.lngdp i.year, fe

. predict r, rstudent
(7,995 missing values generated)

. quietly xtreg lngdp lntariff lnsaving grpop lnhc L1.lngdp i.year if oilprofit>=0.
> 1, fe

. predict r1, rstudent
(7,995 missing values generated)

. sort r

. list r country tariff year if abs(r)>3 & r!=.

       +----------------------------------------------------------------+
       |         r                              country   tariff   year |
       |----------------------------------------------------------------|
    1. | -8.059718   Venezuela (Bolivarian Republic of)    11.03   2014 |
    2. | -6.915554                              Nigeria    25.93   1988 |
    3. | -6.818929                                Congo    12.91   2015 |
    4. | -6.268596                           Tajikistan     6.14   2015 |
    5. | -6.251715                              Myanmar     4.77   2012 |
       |----------------------------------------------------------------|
    6. | -5.792024                              Nigeria    87.19   1995 |
    7. | -5.566912                                Congo    18.24   2007 |
    8. | -5.527637                             Bulgaria     3.47   1997 |
    9. | -5.465002                              Nigeria    27.83   1989 |
   10. | -5.127211                               Gambia    15.58   2011 |
       |----------------------------------------------------------------|
   11. | -5.061028                                Haiti     7.13   2010 |
   12. | -4.814465                              Burundi    20.78   2005 |
   13. |   -4.7515                               Kuwait     3.86   2015 |
   14. | -4.744809                                 Togo    14.61   2005 |
   15. | -4.732761                                Congo    20.49   1994 |
       |----------------------------------------------------------------|
   16. | -4.601948                               Angola     7.77   2009 |
   17. | -4.471826                              Ukraine     7.48   1995 |
   18. | -4.459106                              Nigeria    28.13   1992 |
   19. | -4.383267                                Congo     18.2   2009 |
   20. |  -4.31021                              Nigeria    22.95   1996 |
       |----------------------------------------------------------------|
   21. | -4.281736                              Nigeria    28.02   1990 |
   22. | -4.279397                   Russian Federation    11.11   1994 |
   23. | -4.218554                    D.R. of the Congo    12.92   2008 |
   24. | -4.214418                                 Mali    13.64   2004 |
   25. | -4.205089                           Madagascar     5.61   2002 |
       |----------------------------------------------------------------|
   26. | -4.159462                              Nigeria       23   1998 |
   27. | -4.067681                                Haiti     3.03   2008 |
   28. | -4.026364                                 Togo    14.56   2004 |
   29. | -3.982042                               Belize    20.72   1996 |
   30. | -3.962427                           Mozambique     8.77   2010 |
       |----------------------------------------------------------------|
   31. | -3.955836                                Gabon    18.48   2009 |
   32. | -3.934648                              Burundi    15.83   2006 |
   33. |  -3.92918                                 Togo    13.85   2007 |
   34. | -3.920762                                Niger     14.1   2004 |
   35. | -3.909671                    D.R. of the Congo    13.05   2006 |
       |----------------------------------------------------------------|
   36. | -3.907304                           Madagascar     9.25   2018 |
   37. | -3.848535                                 Togo    14.35   2000 |
   38. |  -3.78891                                 Togo    14.15   2006 |
   39. | -3.762781                              Burundi    11.24   2018 |
   40. |  -3.73924                               Uganda    12.23   2012 |
       |----------------------------------------------------------------|
   41. | -3.713399                              Burundi    13.54   2007 |
   42. | -3.709309                               Zambia    10.64   2015 |
   43. | -3.690033                           Kyrgyzstan     8.17   2002 |
   44. | -3.650535                           Mozambique    10.75   2011 |
   45. | -3.647422                  Republic of Moldova     5.75   1996 |
       |----------------------------------------------------------------|
   46. | -3.635615                               Uganda    11.71   2016 |
   47. | -3.592118                           Mozambique     8.96   2018 |
   48. | -3.517079                         Sierra Leone    12.87   2010 |
   49. | -3.510278                                Congo    19.64   2001 |
   50. | -3.480761                              Lesotho     2.35   2017 |
       |----------------------------------------------------------------|
   51. | -3.470052                               Zambia    11.12   2012 |
   52. | -3.451193                                Niger    13.14   2011 |
   53. | -3.417955                                Haiti     6.33   2016 |
   54. | -3.417583                           Madagascar     6.91   2017 |
   55. | -3.417421                             Bulgaria     3.88   1992 |
       |----------------------------------------------------------------|
   56. | -3.380232                                Congo    17.41   1997 |
   57. | -3.360226                               Kuwait      3.5   2009 |
   58. | -3.348681           U.R. of Tanzania: Mainland    13.22   2012 |
   59. | -3.320177                    D.R. of the Congo    12.02   2019 |
   60. | -3.318974                                Niger    12.71   2007 |
       |----------------------------------------------------------------|
   61. | -3.305449                           Tajikistan     5.19   2013 |
   62. | -3.264139           U.R. of Tanzania: Mainland    15.54   1993 |
   63. | -3.263556                                Nepal    14.72   2005 |
   64. | -3.261024                           Tajikistan     5.01   2006 |
   65. | -3.225887                              Burundi    10.42   2015 |
       |----------------------------------------------------------------|
   66. | -3.216594                                Benin    12.83   2010 |
   67. |  -3.19771                           Kyrgyzstan     3.26   2010 |
   68. | -3.192859                                Niger    10.73   2015 |
   69. | -3.188113                                 Togo    13.53   2010 |
   70. | -3.181675                              Burundi     11.2   2012 |
       |----------------------------------------------------------------|
   71. | -3.177927                                Niger    13.29   2013 |
   72. | -3.170516                                Ghana    12.52   2001 |
   73. | -3.170259                                Niger     12.8   2006 |
   74. | -3.161021                           Mauritania    12.34   2014 |
   75. | -3.155242                              Ukraine     4.07   2009 |
       |----------------------------------------------------------------|
   76. | -3.129783                                Sudan    14.22   2008 |
   77. | -3.101473                           Madagascar     8.89   2019 |
   78. | -3.070994                                Qatar     3.68   2015 |
   79. | -3.065136                              Burundi    10.26   2011 |
   80. | -3.059978                                Niger    13.27   2017 |
       |----------------------------------------------------------------|
   81. | -3.051243                                 Mali    12.88   2007 |
   82. | -3.036714                                 Togo    13.85   2008 |
   83. | -3.028472                                Kenya     20.9   2000 |
   84. | -3.016145                                Nepal    14.66   2002 |
   85. | -3.008621                           Mozambique     7.16   2016 |
       |----------------------------------------------------------------|
   86. | -3.004533                           Madagascar     3.76   2004 |
 2641. |  3.002781                              Nigeria    24.61   2003 |
 2642. |  3.032128                    Brunei Darussalam     3.14   2003 |
 2643. |   3.04002                            Singapore      .17   2010 |
 2644. |  3.044445                            Singapore      .05   2005 |
       |----------------------------------------------------------------|
 2645. |   3.05567                              Iceland     7.41   1998 |
 2646. |  3.083981                               Kuwait     3.88   2017 |
 2647. |  3.098758                               Brazil     14.8   1996 |
 2648. |  3.156969                                Qatar        4   2017 |
 2649. |  3.160576                    Brunei Darussalam     3.31   2006 |
       |----------------------------------------------------------------|
 2650. |  3.219431   Venezuela (Bolivarian Republic of)     12.5   2004 |
 2651. |  3.252864                               Norway      6.5   2000 |
 2652. |  3.279482                         Saudi Arabia    12.65   2000 |
 2653. |  3.297107                               Angola     7.84   2011 |
 2654. |  3.309996                        Côte d'Ivoire    12.91   2014 |
       |----------------------------------------------------------------|
 2655. |  3.365037                               Kuwait     4.03   2008 |
 2656. |  3.484539                             Paraguay    13.39   2002 |
 2657. |  3.521106                    Brunei Darussalam     3.15   2004 |
 2658. |  3.626221                                Gabon    19.79   2000 |
 2659. |  3.721898                              Bahrain     5.41   2003 |
       |----------------------------------------------------------------|
 2660. |  3.760927                               Kuwait      3.9   2018 |
 2661. |  3.785451                            Singapore      .07   2000 |
 2662. |  3.935386                              Bahrain     8.47   1999 |
 2663. |  3.937804                              Iceland     3.55   2008 |
 2664. |   3.96407                    Brunei Darussalam     3.05   2008 |
       |----------------------------------------------------------------|
 2665. |   4.00671                              Ireland     2.55   2019 |
 2666. |  4.035214                    Brunei Darussalam     3.26   2005 |
 2667. |  4.151754                                Congo     18.2   2010 |
 2668. |   4.16143                           Luxembourg     4.31   1999 |
 2669. |  4.339716                               Angola     7.91   2010 |
       |----------------------------------------------------------------|
 2670. |  4.369593                    Brunei Darussalam     2.22   2011 |
 2671. |  4.457561                            Argentina    14.45   1996 |
 2672. |   4.46253                               Kuwait     4.29   2006 |
 2673. |  4.559804                              Myanmar     4.77   2013 |
 2674. |  4.639436                              Bahrain     4.53   2005 |
       |----------------------------------------------------------------|
 2675. |  4.806983                         Saudi Arabia     3.33   2008 |
 2676. |  4.859746                               Kuwait     4.82   2003 |
 2677. |  4.931941                               Kuwait     4.62   2011 |
 2678. |  4.980541                               Kuwait     4.82   2004 |
 2679. |  5.445245                                Gabon    19.65   2005 |
       |----------------------------------------------------------------|
 2680. |  5.466351                              Bahrain     8.45   2000 |
 2681. |  5.700813                         Saudi Arabia     4.83   2011 |
 2682. |  5.873292                               Kuwait     4.31   2005 |
 2683. |  7.065215                                Qatar     4.78   2011 |
 2684. |   7.26223                              Nigeria    10.55   2005 |
       |----------------------------------------------------------------|
 2685. |  7.509504                              Ireland     2.73   2015 |
       +----------------------------------------------------------------+

. sort r1

. list r1 country tariff year if abs(r1)>3 & r!=.

       +----------------------------------------------------------------+
       |        r1                              country   tariff   year |
       |----------------------------------------------------------------|
    1. | -6.760057   Venezuela (Bolivarian Republic of)    11.03   2014 |
    2. | -5.566343                              Myanmar     4.77   2012 |
    3. | -5.304719                              Nigeria    87.19   1995 |
    4. | -5.281087                           Tajikistan     6.14   2015 |
    5. |  -5.27634                                Congo    12.91   2015 |
       |----------------------------------------------------------------|
    6. | -5.240817                              Burundi    20.78   2005 |
    7. | -5.206954                              Nigeria    25.93   1988 |
    8. | -5.039557                                Congo    18.24   2007 |
    9. | -4.940354                               Gambia    15.58   2011 |
   10. | -4.823652                                Haiti     7.13   2010 |
       |----------------------------------------------------------------|
   11. | -4.787607                             Bulgaria     3.47   1997 |
   12. | -4.710099                                 Togo    14.61   2005 |
   13. | -4.538555                              Nigeria    27.83   1989 |
   14. | -4.304213                                 Mali    13.64   2004 |
   15. | -4.252837                              Nigeria    22.95   1996 |
       |----------------------------------------------------------------|
   16. |  -4.21179                    D.R. of the Congo    12.92   2008 |
   17. | -4.191651                                Niger     14.1   2004 |
   18. | -4.147514                           Mozambique     8.77   2010 |
   19. |  -3.94953                              Ukraine     7.48   1995 |
   20. | -3.949078                              Burundi    15.83   2006 |
       |----------------------------------------------------------------|
   21. | -3.949027                              Nigeria    28.13   1992 |
   22. | -3.940701                                 Togo    14.56   2004 |
   23. | -3.892806                           Mozambique    10.75   2011 |
   24. | -3.884396                               Belize    20.72   1996 |
   25. | -3.881374                    D.R. of the Congo    13.05   2006 |
       |----------------------------------------------------------------|
   26. | -3.878869                                Niger    13.14   2011 |
   27. | -3.759968                                Congo    20.49   1994 |
   28. | -3.753924                                Haiti     3.03   2008 |
   29. | -3.726881                           Madagascar     5.61   2002 |
   30. | -3.681728                              Burundi    11.24   2018 |
       |----------------------------------------------------------------|
   31. | -3.675987                               Angola     7.77   2009 |
   32. | -3.646452                              Burundi    13.54   2007 |
   33. | -3.644174                                 Togo    14.35   2000 |
   34. | -3.610918                                 Togo    13.85   2007 |
   35. | -3.592169                           Tajikistan     5.01   2006 |
       |----------------------------------------------------------------|
   36. | -3.586706                               Uganda    12.23   2012 |
   37. | -3.570703                           Kyrgyzstan     3.26   2010 |
   38. | -3.570591                           Madagascar     9.25   2018 |
   39. | -3.546379                                Congo     18.2   2009 |
   40. | -3.543108                                 Togo    14.15   2006 |
       |----------------------------------------------------------------|
   41. | -3.498685                         Sierra Leone    12.87   2010 |
   42. | -3.479225                           Mozambique     8.96   2018 |
   43. | -3.464372                           Kyrgyzstan     8.17   2002 |
   44. | -3.464246                  Republic of Moldova     5.75   1996 |
   45. | -3.453251                               Kuwait     3.86   2015 |
       |----------------------------------------------------------------|
   46. | -3.417435                              Nigeria    28.02   1990 |
   47. | -3.374828                   Russian Federation    11.11   1994 |
   48. | -3.374662                           Tajikistan     5.19   2013 |
   49. | -3.360591                              Burundi    10.26   2011 |
   50. | -3.328447                               Zambia    11.12   2012 |
       |----------------------------------------------------------------|
   51. | -3.316851                                Niger    14.27   2005 |
   52. | -3.252252                                Niger    12.71   2007 |
   53. | -3.235431                                Nepal    14.72   2005 |
   54. | -3.234005                                 Togo    13.53   2010 |
   55. | -3.215384                              Burundi     11.2   2012 |
       |----------------------------------------------------------------|
   56. | -3.189095                                Niger    13.29   2013 |
   57. |  -3.18164                                Niger     12.8   2006 |
   58. | -3.170852           U.R. of Tanzania: Mainland    15.54   1993 |
   59. | -3.156077                           Madagascar     6.91   2017 |
   60. |  -3.13918                              Nigeria       23   1998 |
       |----------------------------------------------------------------|
   61. |  -3.13603                                Gabon    18.48   2009 |
   62. | -3.131754                         Sierra Leone    14.93   2004 |
   63. | -3.128459                                Benin    12.83   2010 |
   64. | -3.122662                           Madagascar     3.76   2004 |
   65. | -3.105394                                Niger    13.27   2017 |
       |----------------------------------------------------------------|
   66. | -3.101932                               Uganda    11.71   2016 |
   67. |  -3.08351                                Niger     12.8   2010 |
   68. | -3.082614           U.R. of Tanzania: Mainland    13.22   2012 |
   69. | -3.043351                             Bulgaria     3.88   1992 |
   70. | -3.019891                              Lesotho     2.35   2017 |
       |----------------------------------------------------------------|
   71. | -3.010531                    D.R. of the Congo    12.02   2019 |
 2644. |  3.073629                             Paraguay    13.39   2002 |
 2645. |  3.108438                                Malta     2.73   2015 |
 2646. |  3.133805                            Singapore      .07   2000 |
 2647. |  3.157443                    Brunei Darussalam     3.26   2005 |
       |----------------------------------------------------------------|
 2648. |  3.196303                                Malta     3.14   1988 |
 2649. |  3.232726                               France     3.14   1988 |
 2650. |  3.278832                    Republic of Korea    18.83   1988 |
 2651. |  3.287051                        Côte d'Ivoire    12.88   2012 |
 2652. |  3.322123                                Congo     18.2   2010 |
       |----------------------------------------------------------------|
 2653. |   3.32584                                Spain     3.14   1988 |
 2654. |  3.364093                              Iceland     3.55   2008 |
 2655. |  3.392517                    Brunei Darussalam     3.05   2008 |
 2656. |   3.41885                              Iceland     7.41   1998 |
 2657. |  3.440632                        Côte d'Ivoire    12.88   2013 |
       |----------------------------------------------------------------|
 2658. |  3.448109                              Bahrain     4.53   2005 |
 2659. |  3.464465                                 Mali     3.46   1995 |
 2660. |  3.481283                               Kuwait      3.9   2018 |
 2661. |  3.486019                               Cyprus     3.14   1988 |
 2662. |  3.501535                              Bahrain     8.47   1999 |
       |----------------------------------------------------------------|
 2663. |   3.52879                    Brunei Darussalam     2.22   2011 |
 2664. |  3.543291                                Italy     3.14   1988 |
 2665. |  3.583193                              Finland     3.14   1988 |
 2666. |  3.619387                              Ireland     2.55   2019 |
 2667. |  3.741323                            Argentina    14.45   1996 |
       |----------------------------------------------------------------|
 2668. |  3.822488                           Luxembourg     4.31   1999 |
 2669. |  3.859683                             Portugal     3.14   1988 |
 2670. |  3.920838                               Kuwait     4.29   2006 |
 2671. |  3.980715                               Angola     7.91   2010 |
 2672. |  3.988195                         Saudi Arabia     3.33   2008 |
       |----------------------------------------------------------------|
 2673. |  4.017331                               Kuwait     4.62   2011 |
 2674. |  4.033659                        Côte d'Ivoire    12.91   2014 |
 2675. |  4.078045                        Côte d'Ivoire    13.13   2009 |
 2676. |  4.268309                              Myanmar     4.77   2013 |
 2677. |  4.301424                               Kuwait     4.82   2004 |
       |----------------------------------------------------------------|
 2678. |  4.331191                                Gabon    19.65   2005 |
 2679. |  4.427291                               Kuwait     4.82   2003 |
 2680. |   4.45074                              Bahrain     8.45   2000 |
 2681. |  4.610075                         Saudi Arabia     4.83   2011 |
 2682. |  4.945497                               Kuwait     4.31   2005 |
       |----------------------------------------------------------------|
 2683. |  5.854236                                Qatar     4.78   2011 |
 2684. |  6.303377                              Nigeria    10.55   2005 |
 2685. |  7.376573                              Ireland     2.73   2015 |
       +----------------------------------------------------------------+

. * The obersvation with r score greater then 3 is considered outlier and will
. * be ignored, the full list please see the list above.
. * For oil producing country, the outlier are siginifcant ar r1>=3, 10% of the obs
. * are outlier with r1 greater equal to 3, those will be excluded
. 
. *test serial correlation
. xtserial lngdp lntariff lnsaving grpop lnhc

Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
    F(  1,     130) =    438.379
           Prob > F =      0.0000

. 
. *The test score is 438, and we reject the null hypothesis that there
. *is no serial correlation. And there is serial correlation presented in
. *this model
. 
. *test for collinearity
. collin lntariff lnsaving grpop lnhc
(obs=2,685)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  lntariff      1.51    1.23    0.6643      0.3357
  lnsaving      1.07    1.04    0.9318      0.0682
     grpop      1.57    1.25    0.6366      0.3634
      lnhc      2.02    1.42    0.4939      0.5061
----------------------------------------------------
  Mean VIF      1.54

                           Cond
        Eigenval          Index
---------------------------------
    1     4.3033          1.0000
    2     0.5075          2.9120
    3     0.1473          5.4045
    4     0.0302         11.9463
    5     0.0117         19.1890
---------------------------------
 Condition Number        19.1890 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4042

. *Since all the VIF is less then 10, we faile to reject the null hypothesis
. *then there is no evidence of multicollineary in this model
. 
. *3Variable TOT graph
. twoway (scatter lngdp lntariff) (lfit lngdp lntariff), title("Natural log of GDP 
> per capita as a function of tariff")

. graph export scatterlntariff.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scatterlntariff.png saved as
    PNG format

. twoway (scatter gdp tariff) (lfit gdp tariff), title("GDP per capita as a functio
> n of tariff")

. graph export scattertariff.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scattertariff.png saved as
    PNG format

. *5 all variables included
. xtpcse lngdp lntariff lnsaving grpop lnhc L1.lngdp i.year if abs(r)<=3, het corr(
> ar1)

Number of gaps in sample = 257
note: computations for rho restarted at each gap.
note: estimates of rho outside [-1,1] bounded to be in the range [-1,1].

Prais–Winsten regression, heteroskedastic panels corrected standard errors

Group variable:   code                          Number of obs     =      2,554
Time variable:    year                          Number of groups  =        135
Panels:           heteroskedastic (unbalanced)  Obs per group:
Autocorrelation:  common AR(1)                                min =          1
                                                              avg =  18.918519
                                                              max =         32
Estimated covariances      =       135          R-squared         =     0.9988
Estimated autocorrelations =         1          Wald chi2(36)     =  893575.35
Estimated coefficients     =        37          Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |            Het-corrected
       lngdp | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    lntariff |  -.0062797   .0019423    -3.23   0.001    -.0100865   -.0024729
    lnsaving |   .0142347   .0027218     5.23   0.000     .0089001    .0195694
       grpop |  -.2893501   .1461166    -1.98   0.048    -.5757334   -.0029668
        lnhc |   .0456026   .0091783     4.97   0.000     .0276135    .0635917
             |
       lngdp |
         L1. |   .9743804   .0022471   433.61   0.000     .9699761    .9787847
             |
        year |
       1989  |  -.0099174   .0083731    -1.18   0.236    -.0263285    .0064936
       1990  |  -.0189999   .0096981    -1.96   0.050    -.0380079    8.06e-06
       1991  |  -.0272343   .0099119    -2.75   0.006    -.0466613   -.0078073
       1992  |   -.015705    .010401    -1.51   0.131    -.0360905    .0046806
       1993  |  -.0333261   .0094759    -3.52   0.000    -.0518985   -.0147536
       1994  |  -.0013046   .0099217    -0.13   0.895    -.0207508    .0181415
       1995  |   .0005222    .009107     0.06   0.954    -.0173273    .0183716
       1996  |  -.0216981   .0089298    -2.43   0.015    -.0392001   -.0041961
       1997  |  -.0277958   .0089864    -3.09   0.002    -.0454089   -.0101827
       1998  |  -.0425113   .0089034    -4.77   0.000    -.0599617    -.025061
       1999  |  -.0392946   .0088414    -4.44   0.000    -.0566233   -.0219658
       2000  |  -.0245844   .0087707    -2.80   0.005    -.0417746   -.0073943
       2001  |   -.034853   .0087233    -4.00   0.000    -.0519504   -.0177556
       2002  |  -.0278596   .0087646    -3.18   0.001     -.045038   -.0106812
       2003  |   -.026422   .0086141    -3.07   0.002    -.0433053   -.0095386
       2004  |  -.0051987   .0087332    -0.60   0.552    -.0223155    .0119181
       2005  |   .0119939   .0086747     1.38   0.167    -.0050083     .028996
       2006  |    .007811   .0086508     0.90   0.367    -.0091442    .0247662
       2007  |   .0024668    .008578     0.29   0.774    -.0143457    .0192793
       2008  |  -.0057548   .0086442    -0.67   0.506    -.0226971    .0111876
       2009  |  -.0615356   .0086084    -7.15   0.000    -.0784077   -.0446634
       2010  |   .0099688   .0086108     1.16   0.247    -.0069081    .0268457
       2011  |   .0087542   .0086136     1.02   0.309     -.008128    .0256365
       2012  |  -.0228147    .008612    -2.65   0.008    -.0396939   -.0059354
       2013  |  -.0474587    .008613    -5.51   0.000    -.0643399   -.0305776
       2014  |  -.0368802   .0087074    -4.24   0.000    -.0539463    -.019814
       2015  |  -.0351245    .008622    -4.07   0.000    -.0520234   -.0182256
       2016  |  -.0379041   .0086802    -4.37   0.000     -.054917   -.0208913
       2017  |  -.0146297    .008785    -1.67   0.096    -.0318481    .0025886
       2018  |  -.0287303   .0086824    -3.31   0.001    -.0457475   -.0117132
       2019  |  -.0375715   .0087178    -4.31   0.000    -.0546581   -.0204849
             |
       _cons |   .2230096   .0207513    10.75   0.000     .1823377    .2636815
-------------+----------------------------------------------------------------
         rho |   .3984101
------------------------------------------------------------------------------

. *predict quadratic graph 
. predict yhat, xb
(7,995 missing values generated)

. twoway (scatter yhat lntot) (qfit yhat lntot)

. graph export totqfit.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/totqfit.png saved as PNG
    format

. *6
. eststo clear

. quietly eststo:xtpcse lngdp lntariff i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lntariff lnsaving i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lntariff lnsaving grpop i.year if abs(r)<=3, het corr
> (ar1)

. quietly eststo:xtpcse lngdp lntariff lnsaving grpop lnhc i.year if abs(r)<=3, het
>  corr(ar1)

. quietly eststo:xtpcse lngdp lntariff lnsaving grpop lnhc L1.lngdp i.year if abs(r
> )<=3, het corr(ar1)

. esttab est1 est2 est3 est4 est5 using Tariff.csv, star(* .10 ** .05 *** .01) se s
> tats(N r2) indicate("Year Dummies =*.year") replace
(file Tariff.csv not found)
(output written to Tariff.csv)

. 
. quietly eststo:xtpcse lngdp lntariff lnsaving grpop lnhc L1.lngdp i.year  if abs(
> r1)<=3&oilprofit>=0.1, het corr(ar1)

. esttab est5 est6 using Tariffoil.csv, star(* .10 ** .05 *** .01) se stats(N r2) i
> ndicate("Year Dummies =*.year") replace
(file Tariffoil.csv not found)
(output written to Tariffoil.csv)

. 
. use final, clear

. 
. *3. Variable FDI outflow
. *check non linearity
. quietly reg lngdp lnfdiout lnsaving grpop lnhc L1.lngdp i.year, cluster(code)

. acprplot lnfdiout, lowess lsopts(bwidth(1))

. graph export nonlinear3.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/nonlinear3.png saved as PNG
    format

. *The graph indicate there is no issue with non linearity
. 
. *fe
. quietly xtreg lngdp lnfdiout lnsaving grpop lnhc L1.lngdp, fe

. 
. *test for year fix effect
. quietly xtreg lngdp lnfdiout lnsaving grpop lnhc L1.lngdp i.year, fe

. testparm i.year

 ( 1)  1971.year = 0
 ( 2)  1972.year = 0
 ( 3)  1973.year = 0
 ( 4)  1974.year = 0
 ( 5)  1975.year = 0
 ( 6)  1976.year = 0
 ( 7)  1977.year = 0
 ( 8)  1978.year = 0
 ( 9)  1979.year = 0
 (10)  1980.year = 0
 (11)  1981.year = 0
 (12)  1982.year = 0
 (13)  1983.year = 0
 (14)  1984.year = 0
 (15)  1985.year = 0
 (16)  1986.year = 0
 (17)  1987.year = 0
 (18)  1988.year = 0
 (19)  1989.year = 0
 (20)  1990.year = 0
 (21)  1991.year = 0
 (22)  1992.year = 0
 (23)  1993.year = 0
 (24)  1994.year = 0
 (25)  1995.year = 0
 (26)  1996.year = 0
 (27)  1997.year = 0
 (28)  1998.year = 0
 (29)  1999.year = 0
 (30)  2000.year = 0
 (31)  2001.year = 0
 (32)  2002.year = 0
 (33)  2003.year = 0
 (34)  2004.year = 0
 (35)  2005.year = 0
 (36)  2006.year = 0
 (37)  2007.year = 0
 (38)  2008.year = 0
 (39)  2009.year = 0
 (40)  2010.year = 0
 (41)  2011.year = 0
 (42)  2012.year = 0
 (43)  2013.year = 0
 (44)  2014.year = 0
 (45)  2015.year = 0
 (46)  2016.year = 0
 (47)  2017.year = 0
 (48)  2018.year = 0
 (49)  2019.year = 0

       F( 49,  3702) =   10.07
            Prob > F =    0.0000

. **The score is 10.07 where we reject the null hypothesis that coefficietns 
. *on dummies for year is equal to 0. Therefore we need to include
. *year fixed effect
. 
. *test homoskedasticity
. quietly xtreg lngdp lnfdiout lnsaving grpop lnhc L1.lngdp, fe

. xttest3

Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

H0: sigma(i)^2 = sigma^2 for all i

chi2 (132)  =  80423.59
Prob>chi2 =      0.0000


. *The result is 80423 and we reject the null hypothesis that this model
. *is homoskedasticity, therefore the residuals are heteroskedastic.
. 
. quietly xtreg lngdp lnfdiout lnsaving grpop lnhc L1.lngdp i.year, fe

. predict r, rstudent
(6,792 missing values generated)

. quietly xtreg lngdp lnfdiout lnsaving grpop lnhc L1.lngdp i.year if oilprofit>=0.
> 1, fe

. predict r1, rstudent
(6,792 missing values generated)

. sort r

. list r country fdiout year if abs(r)>3 & r!=.

       +--------------------------------------------------------------------+
       |         r                              country       fdiout   year |
       |--------------------------------------------------------------------|
    1. | -11.33232                              Nigeria     14411000   1986 |
    2. | -7.482039                              Nigeria   -7889999.9   1987 |
    3. | -7.058564                                Congo       -67000   1986 |
    4. | -7.034715   Venezuela (Bolivarian Republic of)    4.536e+09   2014 |
    5. | -7.011423                                Congo      1208000   1992 |
       |--------------------------------------------------------------------|
    6. | -6.954592                              Nigeria    3.282e+08   1994 |
    7. | -6.133211                                 Iraq    1.477e+08   2015 |
    8. | -6.012901                              Nigeria    5.327e+08   1993 |
    9. | -5.831421                         Sierra Leone       100000   1999 |
   10. | -5.812572                                Congo    5.492e+08   2015 |
       |--------------------------------------------------------------------|
   11. | -5.430668                              Nigeria    5060999.9   1988 |
   12. | -4.952566                                Benin     529509.1   1982 |
   13. | -4.936431                                Niger    263183.99   1984 |
   14. | -4.886128                              Nigeria       861000   1983 |
   15. | -4.679643                             Bulgaria     -1700000   1997 |
       |--------------------------------------------------------------------|
   16. | -4.632687                              Nigeria    4.115e+08   1991 |
   17. | -4.497924                               Kuwait    2.392e+08   1990 |
   18. | -4.458632                               Jordan    -31483126   1990 |
   19. | -4.437705                               Kuwait   -1.864e+08   1991 |
   20. | -4.430515                               Kuwait    5.440e+09   2015 |
       |--------------------------------------------------------------------|
   21. | -4.414667                                Congo    -45258718   2007 |
   22. | -4.401777                              Ukraine      8000000   1994 |
   23. | -4.390079                                Congo   -2.106e+08   1998 |
   24. | -4.385569                              Nigeria    7.977e+08   1989 |
   25. |  -4.28257                              Bahrain   -7387291.9   1985 |
       |--------------------------------------------------------------------|
   26. | -4.274611                              Nigeria    1.918e+08   1995 |
   27. | -4.050301                                Congo    1.197e+09   2016 |
   28. | -3.990698                               Angola    6753124.6   2009 |
   29. | -3.969303                                 Mali      54394.6   1988 |
   30. | -3.926511                                 Peru    2299999.9   1989 |
       |--------------------------------------------------------------------|
   31. |  -3.92322                               Gambia    -58264987   2011 |
   32. | -3.884753                   Russian Federation    3.110e+08   1994 |
   33. | -3.880792                  Republic of Moldova        40000   1999 |
   34. | -3.870351                                 Togo   -6702863.1   1993 |
   35. | -3.859401                              Nigeria    1500999.9   1984 |
       |--------------------------------------------------------------------|
   36. | -3.706063                              Ukraine     10000000   1995 |
   37. | -3.688894                               Kuwait    2.478e+08   1986 |
   38. | -3.643473                              Nigeria    -27000000   1982 |
   39. | -3.598675                                Congo      -912000   1994 |
   40. | -3.578736                              Nigeria    2.601e+08   1992 |
       |--------------------------------------------------------------------|
   41. | -3.550276                                Gabon    2.435e+08   2009 |
   42. | -3.524443                                 Togo    4103301.4   2005 |
   43. | -3.490631                                Congo    -89543049   2009 |
   44. | -3.462455                              Nigeria    4.146e+08   1990 |
   45. | -3.456693                                 Mali     241066.4   1987 |
       |--------------------------------------------------------------------|
   46. | -3.439584                             Barbados       850000   1992 |
   47. | -3.370167                              Burundi    600582.57   1995 |
   48. | -3.354055                                 Mali    1542298.1   1992 |
   49. | -3.299578                                Benin    -20756309   1994 |
   50. | -3.260326                              Nigeria    5.972e+08   1996 |
       |--------------------------------------------------------------------|
   51. | -3.246311                                 Mali    -15379961   2004 |
   52. |  -3.24024                           Kazakhstan       300000   1995 |
   53. | -3.238147                              Namibia    1352750.7   1990 |
   54. |  -3.21843                              Burundi    135925.53   1993 |
   55. | -3.200177                    D.R. of the Congo    2.922e+08   2017 |
       |--------------------------------------------------------------------|
   56. | -3.194247                               Kuwait    8.582e+09   2009 |
   57. | -3.187544                                Gabon    6583774.6   1986 |
   58. | -3.173058                               Belize      5665000   1996 |
   59. | -3.168938                                Gabon    2.175e+08   1997 |
   60. | -3.142967                  Republic of Moldova      -730000   1998 |
       |--------------------------------------------------------------------|
   61. | -3.137962                                 Togo    8717368.6   2004 |
   62. | -3.067143                                 Togo   -8451538.3   1998 |
   63. | -3.066876                              Ukraine     -5000000   1996 |
   64. | -3.034561                  Republic of Moldova       560000   1996 |
   65. |  -3.03445                           Mozambique    2.379e+08   2010 |
       |--------------------------------------------------------------------|
 3853. |  3.020012                        Côte d'Ivoire     14300851   2012 |
 3854. |  3.045092                             Paraguay     84500000   2002 |
 3855. |  3.200818                        Côte d'Ivoire    9478480.5   2009 |
 3856. |  3.220034                              Nigeria      1847000   1985 |
 3857. |  3.221882                         Saudi Arabia    3.907e+09   2010 |
       |--------------------------------------------------------------------|
 3858. |  3.281121                               Kuwait    8.211e+09   2006 |
 3859. |  3.292938                              Ireland   -1.441e+11   2019 |
 3860. |  3.335207                        Côte d'Ivoire   -6401442.4   2013 |
 3861. |  3.394993                              Bahrain    7.414e+08   2003 |
 3862. |  3.495662                        Côte d'Ivoire     16218898   2014 |
       |--------------------------------------------------------------------|
 3863. |  3.522709                               Kuwait    2.581e+09   2004 |
 3864. |  3.530002                               Angola    1.340e+09   2010 |
 3865. |  3.573476                              Bahrain    1.634e+08   1999 |
 3866. |   3.67731                                Congo    5.923e+08   2010 |
 3867. |  3.728064                            Argentina    1.601e+09   1996 |
       |--------------------------------------------------------------------|
 3868. |  3.729079                              Iceland   -3.779e+09   2008 |
 3869. |  3.790252                               Kuwait   -4.960e+09   2003 |
 3870. |  3.843909                         Saudi Arabia    3.498e+09   2008 |
 3871. |  3.852768                               Kuwait    1.077e+10   2011 |
 3872. |  3.853084                     China, Macao SAR    -77037749   2004 |
       |--------------------------------------------------------------------|
 3873. |  4.166209                              Bahrain    1.135e+09   2005 |
 3874. |  4.175043                     China, Macao SAR    3.646e+08   2011 |
 3875. |  4.450195                     China, Macao SAR   -2.801e+08   2010 |
 3876. |  4.487964                               Kuwait    5.142e+09   2005 |
 3877. |  4.531896                         Saudi Arabia    3.430e+09   2011 |
       |--------------------------------------------------------------------|
 3878. |  4.631861                                Gabon    1.592e+08   2005 |
 3879. |  4.633988                                Gabon    8024869.6   1989 |
 3880. |  4.693664                              Bahrain    9552708.3   2000 |
 3881. |  5.374086                                Congo   -2.600e+08   2000 |
 3882. |  5.573275                               Kuwait    6.394e+08   1993 |
       |--------------------------------------------------------------------|
 3883. |  5.836045                                Qatar    1.011e+10   2011 |
 3884. |  6.149328                              Ireland    1.896e+11   2015 |
 3885. |  6.277409                             Barbados      1100000   1994 |
 3886. |  6.351358                              Nigeria     14635077   2005 |
 3887. |   6.36898                               Kuwait   -1.882e+08   1979 |
       |--------------------------------------------------------------------|
 3888. |  11.58163                               Kuwait    1.211e+09   1992 |
       +--------------------------------------------------------------------+

. sort r1

. list r1 country fdiout year if abs(r1)>3 & r1!=.

       +--------------------------------------------------------------------+
       |        r1                              country       fdiout   year |
       |--------------------------------------------------------------------|
    1. | -9.060021                              Nigeria     14411000   1986 |
    2. | -6.353694                              Nigeria   -7889999.9   1987 |
    3. | -6.090472                                Congo      1208000   1992 |
    4. | -6.039116                              Nigeria    3.282e+08   1994 |
    5. | -5.815181   Venezuela (Bolivarian Republic of)    4.536e+09   2014 |
       |--------------------------------------------------------------------|
    6. | -5.589372                              Nigeria    5.327e+08   1993 |
    7. | -5.301461                                Congo       -67000   1986 |
    8. | -5.243427                         Sierra Leone       100000   1999 |
    9. | -4.581357                                 Iraq    1.477e+08   2015 |
   10. |  -4.47894                              Nigeria    5060999.9   1988 |
       |--------------------------------------------------------------------|
   11. | -4.447361                                Congo    5.492e+08   2015 |
   12. | -4.342519                                Niger    263183.99   1984 |
   13. | -4.160168                              Nigeria       861000   1983 |
   14. | -4.008252                              Nigeria    4.115e+08   1991 |
   15. | -3.995469                                Benin     529509.1   1982 |
       |--------------------------------------------------------------------|
   16. | -3.931223                             Bulgaria     -1700000   1997 |
   17. | -3.889397                                Congo    -45258718   2007 |
   18. | -3.888172                              Nigeria    1.918e+08   1995 |
   19. | -3.813891                              Nigeria    7.977e+08   1989 |
   20. |  -3.69006                               Gambia    -58264987   2011 |
       |--------------------------------------------------------------------|
   21. | -3.641008                  Republic of Moldova        40000   1999 |
   22. | -3.634359                              Ukraine      8000000   1994 |
   23. | -3.622286                               Jordan    -31483126   1990 |
   24. | -3.546523                               Kuwait   -1.864e+08   1991 |
   25. | -3.534903                                 Togo   -6702863.1   1993 |
       |--------------------------------------------------------------------|
   26. | -3.529362                                 Togo    4103301.4   2005 |
   27. | -3.529141                               Kuwait    2.392e+08   1990 |
   28. | -3.381032                              Nigeria    1500999.9   1984 |
   29. |  -3.35593                                Congo   -2.106e+08   1998 |
   30. | -3.295166                              Nigeria    2.601e+08   1992 |
       |--------------------------------------------------------------------|
   31. |  -3.29127                                Congo    1.197e+09   2016 |
   32. | -3.288894                                 Peru    2299999.9   1989 |
   33. | -3.284545                              Bahrain   -7387291.9   1985 |
   34. |  -3.25118                                 Mali      54394.6   1988 |
   35. | -3.216404                              Ukraine     10000000   1995 |
       |--------------------------------------------------------------------|
   36. |   -3.1689                              Nigeria    5.972e+08   1996 |
   37. |  -3.15603                                 Mali    -15379961   2004 |
   38. | -3.120064                                 Togo    8717368.6   2004 |
   39. | -3.115613                   Russian Federation    3.110e+08   1994 |
   40. | -3.106609                               Angola    6753124.6   2009 |
       |--------------------------------------------------------------------|
   41. |  -3.08529                           Mozambique    2.379e+08   2010 |
   42. | -3.070792                              Burundi    135925.53   1993 |
   43. | -3.051151                                 Mali    1542298.1   1992 |
   44. |  -3.02515                    D.R. of the Congo    2.922e+08   2017 |
 3861. |  3.004608                               Kuwait    8.211e+09   2006 |
       |--------------------------------------------------------------------|
 3862. |  3.038274                              Ireland   -1.441e+11   2019 |
 3863. |  3.047903                        Côte d'Ivoire   -6401442.4   2013 |
 3864. |  3.116521                            Argentina    1.601e+09   1996 |
 3865. |  3.124381                              Bahrain    1.634e+08   1999 |
 3866. |  3.190596                        Côte d'Ivoire    9478480.5   2009 |
       |--------------------------------------------------------------------|
 3867. |  3.212189                     China, Macao SAR    -77037749   2004 |
 3868. |  3.230948                              Iceland   -3.779e+09   2008 |
 3869. |  3.244279                         Saudi Arabia    3.498e+09   2008 |
 3870. |  3.270538                               Kuwait   -4.960e+09   2003 |
 3871. |  3.311355                        Côte d'Ivoire     16218898   2014 |
       |--------------------------------------------------------------------|
 3872. |  3.325272                               Kuwait    1.077e+10   2011 |
 3873. |  3.468384                              Bahrain    1.135e+09   2005 |
 3874. |  3.526307                     China, Macao SAR    3.646e+08   2011 |
 3875. |  3.644806                                Gabon    1.592e+08   2005 |
 3876. |  3.752937                     China, Macao SAR   -2.801e+08   2010 |
       |--------------------------------------------------------------------|
 3877. |  3.753066                         Saudi Arabia    3.430e+09   2011 |
 3878. |  3.769541                               Kuwait    5.142e+09   2005 |
 3879. |  3.814387                              Bahrain    9552708.3   2000 |
 3880. |  4.115731                                Congo   -2.600e+08   2000 |
 3881. |   4.12081                                Gabon    8024869.6   1989 |
       |--------------------------------------------------------------------|
 3882. |  4.758928                               Kuwait    6.394e+08   1993 |
 3883. |  5.046883                              Nigeria     14635077   2005 |
 3884. |   5.16867                                Qatar    1.011e+10   2011 |
 3885. |  5.569151                               Kuwait   -1.882e+08   1979 |
 3886. |  5.623402                             Barbados      1100000   1994 |
       |--------------------------------------------------------------------|
 3887. |  5.924254                              Ireland    1.896e+11   2015 |
 3888. |  10.07258                               Kuwait    1.211e+09   1992 |
       +--------------------------------------------------------------------+

. * The obersvation with r score greater then 3 is considered outlier and will
. * be ignored, the full list please see the list above.
. * For oil producing country, the outlier are siginifcant ar r1>=3, 2% of the obs
. * are outlier with r1 greater equal to 3, those will be excluded
. 
. *test serial correlation
. xtserial lngdp lnfdiout lnsaving grpop lnhc

Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
    F(  1,     129) =    820.695
           Prob > F =      0.0000

. 
. *The test score is 820, and we reject the null hypothesis that there
. *is no serial correlation. And there is serial correlation presented in
. *this model
. 
. *test for collinearity
. collin lnfdiout lnsaving grpop lnhc
(obs=3,888)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  lnfdiout      1.09    1.04    0.9197      0.0803
  lnsaving      1.10    1.05    0.9059      0.0941
     grpop      1.67    1.29    0.6004      0.3996
      lnhc      1.82    1.35    0.5508      0.4492
----------------------------------------------------
  Mean VIF      1.42

                           Cond
        Eigenval          Index
---------------------------------
    1     4.0635          1.0000
    2     0.5641          2.6839
    3     0.3148          3.5926
    4     0.0389         10.2248
    5     0.0187         14.7441
---------------------------------
 Condition Number        14.7441 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.5217

. *Since all the VIF is less then 10, we faile to reject the null hypothesis
. *then there is no evidence of multicollineary in this model
. 
. *3Variable TOT graph
. twoway (scatter lngdp lnfdiout) (lfit lngdp lnfdiout), title("Natural log of GDP 
> per capita as a function of FDIoutflow")

. graph export scatterlnfdi.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scatterlnfdi.png saved as PNG
    format

. twoway (scatter gdp fdiout) (lfit gdp fdiout), title("GDP per capita as a functio
> n of FDIoutflow")

. graph export scatterfdi.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scatterfdi.png saved as PNG
    format

. *5 all variables included
. xtpcse lngdp lnfdiout lnsaving grpop lnhc L1.lngdp i.year if abs(r)<=3, het corr(
> ar1)

Number of gaps in sample = 116
note: computations for rho restarted at each gap.

Prais–Winsten regression, heteroskedastic panels corrected standard errors

Group variable:   code                          Number of obs     =      3,787
Time variable:    year                          Number of groups  =        132
Panels:           heteroskedastic (unbalanced)  Obs per group:
Autocorrelation:  common AR(1)                                min =          1
                                                              avg =  28.689394
                                                              max =         50
Estimated covariances      =       132          R-squared         =     0.9976
Estimated autocorrelations =         1          Wald chi2(54)     = 1061303.74
Estimated coefficients     =        55          Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |            Het-corrected
       lngdp | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    lnfdiout |   .0001357   .0000645     2.10   0.035     9.31e-06    .0002622
    lnsaving |   .0214197   .0023112     9.27   0.000     .0168898    .0259496
       grpop |  -.7708686   .1393481    -5.53   0.000    -1.043986   -.4977513
        lnhc |   .0245459   .0078671     3.12   0.002     .0091266    .0399652
             |
       lngdp |
         L1. |   .9806925   .0019428   504.78   0.000     .9768846    .9845003
             |
        year |
       1971  |   -.015432   .0099008    -1.56   0.119    -.0348373    .0039733
       1972  |   .0037082   .0116659     0.32   0.751    -.0191565    .0265729
       1973  |   .0196333   .0122057     1.61   0.108    -.0042893     .043556
       1974  |  -.0070942   .0128102    -0.55   0.580    -.0322017    .0180133
       1975  |  -.0461543   .0121558    -3.80   0.000    -.0699793   -.0223293
       1976  |   .0051402     .01191     0.43   0.666     -.018203    .0284835
       1977  |  -.0093476   .0118836    -0.79   0.432    -.0326391    .0139438
       1978  |  -.0146035    .011644    -1.25   0.210    -.0374254    .0082184
       1979  |   .0009205     .01141     0.08   0.936    -.0214426    .0232836
       1980  |  -.0040524   .0111871    -0.36   0.717    -.0259786    .0178739
       1981  |   -.042182   .0111339    -3.79   0.000     -.064004   -.0203599
       1982  |  -.0544337   .0110197    -4.94   0.000    -.0760318   -.0328356
       1983  |  -.0330984   .0110704    -2.99   0.003    -.0547961   -.0114007
       1984  |  -.0191293   .0108891    -1.76   0.079    -.0404716     .002213
       1985  |   -.025279   .0109054    -2.32   0.020    -.0466532   -.0039049
       1986  |  -.0222094   .0106795    -2.08   0.038    -.0431407    -.001278
       1987  |  -.0234035   .0106647    -2.19   0.028    -.0443058   -.0025011
       1988  |   -.026388   .0106004    -2.49   0.013    -.0471644   -.0056116
       1989  |  -.0257571    .010596    -2.43   0.015    -.0465248   -.0049893
       1990  |  -.0193058   .0104558    -1.85   0.065    -.0397988    .0011871
       1991  |   -.021105   .0103888    -2.03   0.042    -.0414667   -.0007434
       1992  |  -.0245908   .0103066    -2.39   0.017    -.0447913   -.0043903
       1993  |   -.020209    .010243    -1.97   0.049     -.040285   -.0001329
       1994  |  -.0060084   .0102208    -0.59   0.557    -.0260409    .0140241
       1995  |  -.0058022   .0100904    -0.58   0.565    -.0255789    .0139746
       1996  |  -.0059049   .0100426    -0.59   0.557    -.0255881    .0137782
       1997  |  -.0296155   .0100424    -2.95   0.003    -.0492983   -.0099326
       1998  |  -.0412687    .009995    -4.13   0.000    -.0608586   -.0216787
       1999  |  -.0242652   .0100227    -2.42   0.015    -.0439093    -.004621
       2000  |  -.0120949    .009975    -1.21   0.225    -.0316456    .0074557
       2001  |  -.0291675   .0099363    -2.94   0.003    -.0486422   -.0096928
       2002  |  -.0181878   .0099573    -1.83   0.068    -.0377037    .0013281
       2003  |  -.0156965   .0099111    -1.58   0.113    -.0351218    .0037289
       2004  |   .0081496   .0098892     0.82   0.410    -.0112329    .0275322
       2005  |   .0208299   .0098292     2.12   0.034     .0015651    .0400947
       2006  |    .018575   .0097955     1.90   0.058    -.0006239    .0377739
       2007  |   .0108466   .0097922     1.11   0.268    -.0083457    .0300389
       2008  |   .0041016   .0098077     0.42   0.676    -.0151212    .0233243
       2009  |  -.0498248   .0097619    -5.10   0.000    -.0689578   -.0306918
       2010  |   .0189417   .0097816     1.94   0.053    -.0002299    .0381134
       2011  |   .0209887   .0098011     2.14   0.032     .0017788    .0401986
       2012  |  -.0142125   .0098397    -1.44   0.149    -.0334979     .005073
       2013  |  -.0392194   .0098368    -3.99   0.000    -.0584992   -.0199397
       2014  |  -.0319645    .009808    -3.26   0.001    -.0511878   -.0127411
       2015  |  -.0313468   .0097823    -3.20   0.001    -.0505197   -.0121738
       2016  |  -.0268891   .0098079    -2.74   0.006    -.0461122   -.0076659
       2017  |  -.0053141   .0098214    -0.54   0.588    -.0245637    .0139355
       2018  |  -.0204812   .0098281    -2.08   0.037    -.0397441   -.0012184
       2019  |  -.0314716   .0098576    -3.19   0.001    -.0507922    -.012151
             |
       _cons |   .1457389   .0173919     8.38   0.000     .1116514    .1798264
-------------+----------------------------------------------------------------
         rho |   .3365543
------------------------------------------------------------------------------

. 
. 
. *6
. eststo clear

. quietly eststo:xtpcse lngdp lnfdiout i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lnfdiout lnsaving  i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lnfdiout lnsaving grpop i.year if abs(r)<=3, het corr
> (ar1)

. quietly eststo:xtpcse lngdp lnfdiout lnsaving grpop lnhc i.year if abs(r)<=3, het
>  corr(ar1)

. quietly eststo:xtpcse lngdp lnfdiout lnsaving grpop lnhc L1.lngdp i.year if abs(r
> )<=3, het corr(ar1)

. esttab est1 est2 est3 est4 est5 using FDIoutflow.csv, star(* .10 ** .05 *** .01) 
> se stats(N r2) indicate("Year Dummies =*.year") replace
(file FDIoutflow.csv not found)
(output written to FDIoutflow.csv)

. 
. quietly eststo:xtpcse lngdp lnfdiout lnsaving grpop lnhc L1.lngdp i.year if abs(r
> 1)<=3&oilprofit>=0.1, het corr(ar1)

. esttab est5 est6 using FDIoutflowoil.csv, star(* .10 ** .05 *** .01) se stats(N r
> 2) indicate("Year Dummies =*.year") replace
(file FDIoutflowoil.csv not found)
(output written to FDIoutflowoil.csv)

. 
. 
. use final, clear

. 
. *4. Variable trade openness
. *check non linearity
. quietly reg lngdp lntropen lnsaving grpop lnhc L1.lngdp i.year, cluster(code)

. acprplot lntropen, lowess lsopts(bwidth(1))

. graph export nonlinear4.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/nonlinear4.png saved as PNG
    format

. *The graph indicate there is no issue with non linearity
. 
. *fe
. xtreg lngdp lntropen lnsaving grpop lnhc L1.lngdp, fe

Fixed-effects (within) regression               Number of obs     =      4,752
Group variable: code                            Number of groups  =        139

R-squared:                                      Obs per group:
     Within  = 0.9713                                         min =          6
     Between = 0.9993                                         avg =       34.2
     Overall = 0.9964                                         max =         59

                                                F(5,4608)         =   31209.99
corr(u_i, Xb) = 0.5435                          Prob > F          =     0.0000

------------------------------------------------------------------------------
       lngdp | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    lntropen |   .0272055     .00398     6.84   0.000     .0194027    .0350082
    lnsaving |   .0228235   .0017676    12.91   0.000     .0193581    .0262889
       grpop |  -.7755291   .1662451    -4.66   0.000    -1.101449    -.449609
        lnhc |   .0960997   .0116975     8.22   0.000     .0731669    .1190325
             |
       lngdp |
         L1. |   .9496187   .0036111   262.98   0.000     .9425393    .9566981
             |
       _cons |   .2340409   .0291103     8.04   0.000     .1769708    .2911111
-------------+----------------------------------------------------------------
     sigma_u |  .03587017
     sigma_e |  .06643937
         rho |  .22569739   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(138, 4608) = 3.00                   Prob > F = 0.0000

. 
. *test for year fix effect
. quietly xtreg lngdp lntropen lnsaving grpop lnhc L1.lngdp i.year, fe

. testparm i.year

 ( 1)  1962.year = 0
 ( 2)  1963.year = 0
 ( 3)  1964.year = 0
 ( 4)  1965.year = 0
 ( 5)  1966.year = 0
 ( 6)  1967.year = 0
 ( 7)  1968.year = 0
 ( 8)  1969.year = 0
 ( 9)  1970.year = 0
 (10)  1971.year = 0
 (11)  1972.year = 0
 (12)  1973.year = 0
 (13)  1974.year = 0
 (14)  1975.year = 0
 (15)  1976.year = 0
 (16)  1977.year = 0
 (17)  1978.year = 0
 (18)  1979.year = 0
 (19)  1980.year = 0
 (20)  1981.year = 0
 (21)  1982.year = 0
 (22)  1983.year = 0
 (23)  1984.year = 0
 (24)  1985.year = 0
 (25)  1986.year = 0
 (26)  1987.year = 0
 (27)  1988.year = 0
 (28)  1989.year = 0
 (29)  1990.year = 0
 (30)  1991.year = 0
 (31)  1992.year = 0
 (32)  1993.year = 0
 (33)  1994.year = 0
 (34)  1995.year = 0
 (35)  1996.year = 0
 (36)  1997.year = 0
 (37)  1998.year = 0
 (38)  1999.year = 0
 (39)  2000.year = 0
 (40)  2001.year = 0
 (41)  2002.year = 0
 (42)  2003.year = 0
 (43)  2004.year = 0
 (44)  2005.year = 0
 (45)  2006.year = 0
 (46)  2007.year = 0
 (47)  2008.year = 0
 (48)  2009.year = 0
 (49)  2010.year = 0
 (50)  2011.year = 0
 (51)  2012.year = 0
 (52)  2013.year = 0
 (53)  2014.year = 0
 (54)  2015.year = 0
 (55)  2016.year = 0
 (56)  2017.year = 0
 (57)  2018.year = 0
 (58)  2019.year = 0

       F( 58,  4550) =    8.01
            Prob > F =    0.0000

. **The score is 8 where we reject the null hypothesis that coefficietns 
. *on dummies for year is equal to 0. Therefore we need to include
. *year fixed effect
. 
. *test homoskedasticity
. quietly xtreg lngdp lntropen lnsaving grpop lnhc L1.lngdp, fe

. xttest3

Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

H0: sigma(i)^2 = sigma^2 for all i

chi2 (139)  =  27266.25
Prob>chi2 =      0.0000


. *The result is 27266 and we reject the null hypothesis that this model
. *is homoskedasticity, therefore the residuals are heteroskedastic.
. 
. quietly xtreg lngdp lntropen lnsaving grpop lnhc L1.lngdp i.year, fe

. predict r, rstudent
(5,928 missing values generated)

. quietly xtreg lngdp lntropen lnsaving grpop lnhc L1.lngdp i.year if oilprofit>=0.
> 1, fe

. predict r1, rstudent
(5,928 missing values generated)

. sort r

. list r country tropen year if abs(r)>3 & r!=.

       +------------------------------------------------------------------+
       |         r                              country     tropen   year |
       |------------------------------------------------------------------|
    1. |  -9.97686                              Nigeria   9.135846   1986 |
    2. |   -6.8527                                Congo   93.50224   1986 |
    3. | -6.588093                              Nigeria   19.49533   1987 |
    4. | -6.499352   Venezuela (Bolivarian Republic of)   48.09081   2014 |
    5. | -6.325597                             Mongolia   136.6038   1991 |
       |------------------------------------------------------------------|
    6. | -6.245849                                Congo   57.14071   1992 |
    7. | -6.001494                              Nigeria   23.05924   1994 |
    8. | -5.706732                         Sierra Leone   33.74916   1999 |
    9. | -5.650246           Iran (Islamic Republic of)   42.48267   1980 |
   10. |  -5.56766                                 Iraq   69.59177   2015 |
       |------------------------------------------------------------------|
   11. | -5.346361                               Kuwait    142.613   1991 |
   12. | -5.325845                                Congo   122.6936   2015 |
   13. | -5.121894                              Nigeria   33.71975   1993 |
   14. | -5.071805                              Lesotho   145.7225   1979 |
   15. | -5.048922                             Mongolia   129.7421   1993 |
       |------------------------------------------------------------------|
   16. | -4.946589                           Kyrgyzstan   71.82427   1995 |
   17. | -4.808444                                Niger   49.87572   1984 |
   18. | -4.777593                               Angola   152.5471   2000 |
   19. | -4.765281                                Benin   57.85733   1982 |
   20. | -4.599457                              Nigeria   16.94061   1988 |
       |------------------------------------------------------------------|
   21. | -4.566855                              Myanmar    11.8554   2012 |
   22. | -4.556699                                Congo   148.9017   1998 |
   23. | -4.490502                           Kyrgyzstan   73.83021   1994 |
   24. | -4.479534                               Jordan   149.4534   1990 |
   25. | -4.392503                             Bulgaria   86.46374   1997 |
       |------------------------------------------------------------------|
   26. | -4.277164                                Congo   148.5866   2007 |
   27. | -4.260697                              Bahrain   191.6102   1985 |
   28. |  -4.20184                               Kuwait    103.011   1990 |
   29. |  -4.16925                            Sri Lanka   79.46437   1979 |
   30. | -3.996108                               Kuwait   98.69957   2015 |
       |------------------------------------------------------------------|
   31. | -3.944189                              Ukraine   73.94401   1994 |
   32. | -3.917216                              Armenia   112.4294   1994 |
   33. | -3.826186                                 Togo   56.47844   1993 |
   34. |  -3.81327                              Nigeria   37.02161   1991 |
   35. | -3.798471                               Angola   122.4461   2009 |
       |------------------------------------------------------------------|
   36. | -3.795733                              Nigeria   10.04497   1983 |
   37. |  -3.79277                                Congo   130.7777   2016 |
   38. | -3.755796                               Gambia    42.6397   2011 |
   39. | -3.749945                                 Mali   46.82693   1988 |
   40. | -3.708225                  Republic of Moldova   117.5279   1999 |
       |------------------------------------------------------------------|
   41. |  -3.68658                                Haiti   44.72187   2010 |
   42. | -3.679906                              Nigeria   34.18262   1989 |
   43. |  -3.65203                              Nigeria   39.52838   1995 |
   44. | -3.580374                                 Togo   97.10271   1975 |
   45. | -3.548366                              Albania   108.7855   1992 |
       |------------------------------------------------------------------|
   46. | -3.520714                                Congo   132.7363   1994 |
   47. |  -3.51802                                Sudan   28.12366   2012 |
   48. | -3.464767                         Sierra Leone   49.59553   1996 |
   49. |  -3.45348                                Congo   135.5524   2009 |
   50. | -3.426716                               Kuwait    94.1991   1986 |
       |------------------------------------------------------------------|
   51. | -3.407691                              Ukraine    97.2297   1995 |
   52. | -3.387616                                 Peru   22.53676   1989 |
   53. | -3.370734                   Russian Federation   50.95371   1994 |
   54. | -3.355317                                 Togo    86.7753   2005 |
   55. | -3.344347                           Kyrgyzstan   84.47713   1997 |
       |------------------------------------------------------------------|
   56. | -3.307047                  Republic of Moldova   116.8031   1998 |
   57. | -3.278394                             Mongolia   77.97408   1996 |
   58. | -3.271042                                 Togo   99.19695   1981 |
   59. | -3.249164                                Gabon   83.50458   2009 |
   60. | -3.183744                                Benin   64.40048   1994 |
       |------------------------------------------------------------------|
   61. | -3.171399                          El Salvador   67.40646   1980 |
   62. |  -3.16079                                 Mali   46.05651   1987 |
   63. | -3.158642                                Haiti   45.75664   2017 |
   64. | -3.145131                                Gabon   89.89565   1986 |
   65. | -3.127158                                 Mali   55.31162   2004 |
       |------------------------------------------------------------------|
   66. |  -3.12704                                Chile   50.68444   1975 |
   67. | -3.123246                          El Salvador   60.26649   1981 |
   68. | -3.119508                                 Togo   72.98782   1998 |
   69. | -3.116867                              Burundi   40.20463   1995 |
   70. | -3.099195                           Kyrgyzstan   74.70633   1993 |
       |------------------------------------------------------------------|
   71. | -3.094496                    Brunei Darussalam   89.89379   2015 |
   72. | -3.073383                              Nigeria   13.77983   1982 |
   73. | -3.072046                             Barbados   75.92233   1992 |
   74. | -3.021501                             Mongolia   94.90463   1981 |
   75. | -3.006361                           Kazakhstan   82.52241   1995 |
       |------------------------------------------------------------------|
   76. |  -3.00572                               Belize   100.2261   1996 |
 4711. |   3.04998                              Iceland   82.68803   2008 |
 4712. |  3.072361                              Bahrain   141.8317   1999 |
 4713. |   3.11783                              Bahrain   128.0916   2003 |
 4714. |   3.13458                    Brunei Darussalam   99.53654   2011 |
       |------------------------------------------------------------------|
 4715. |  3.222717                         Saudi Arabia    82.5498   2010 |
 4716. |   3.26984                                 Mali   59.73471   1985 |
 4717. |  3.300326                         Saudi Arabia   83.98095   1976 |
 4718. |  3.337237                               Kuwait    89.7131   2006 |
 4719. |  3.372174                               Angola   104.1236   2010 |
       |------------------------------------------------------------------|
 4720. |  3.416124                 Syrian Arab Republic   78.11493   2004 |
 4721. |  3.451865                               Kuwait   89.29764   2004 |
 4722. |  3.464856                     China, Macao SAR   148.9037   2004 |
 4723. |  3.496955                               Kuwait   86.55518   2003 |
 4724. |  3.530277                         Saudi Arabia   71.90112   1971 |
       |------------------------------------------------------------------|
 4725. |   3.53308                                Congo   124.0648   2010 |
 4726. |   3.58127                              Nigeria   10.39198   1985 |
 4727. |   3.71826                         Sierra Leone    87.4528   2013 |
 4728. |   3.78612                               Kuwait   99.09037   2011 |
 4729. |  3.824476                         Saudi Arabia   96.10265   2008 |
       |------------------------------------------------------------------|
 4730. |  3.850954                              Bahrain   148.3135   2005 |
 4731. |  3.882504                             Mongolia   58.62189   1990 |
 4732. |  3.910383                            Argentina   21.50647   1996 |
 4733. |  3.932144                              Myanmar    30.9831   2013 |
 4734. |   4.05873                     China, Macao SAR   122.8884   2011 |
       |------------------------------------------------------------------|
 4735. |   4.13878                     China, Macao SAR   119.9401   2010 |
 4736. |  4.326151                                Gabon   86.99364   1989 |
 4737. |  4.359278                              Bahrain   135.8091   2000 |
 4738. |  4.385455                               Kuwait   92.24268   2005 |
 4739. |  4.461923                         Saudi Arabia   85.54352   2011 |
       |------------------------------------------------------------------|
 4740. |  4.480426                                Gabon    83.9496   2005 |
 4741. |  4.547402                                Malta   160.0243   1975 |
 4742. |  4.866404                 Syrian Arab Republic     80.133   2005 |
 4743. |  4.874977                                Congo   123.9099   2000 |
 4744. |  5.460569                               Kuwait   92.05704   1993 |
       |------------------------------------------------------------------|
 4745. |  5.593334                                Qatar   98.72164   2011 |
 4746. |  5.741412                              Ireland    215.164   2015 |
 4747. |  5.872998                             Barbados   83.42039   1994 |
 4748. |  6.193198                               Kuwait   106.7868   1979 |
 4749. |  6.217826                              Nigeria   33.05946   2005 |
       |------------------------------------------------------------------|
 4750. |  7.385859                         Saudi Arabia    76.1384   1974 |
 4751. |  8.611431                             Zimbabwe   61.77844   2009 |
 4752. |  10.96364                               Kuwait   94.68806   1992 |
       +------------------------------------------------------------------+

. sort r1

. list r1 country tropen year if abs(r1)>3 & r1!=.

       +------------------------------------------------------------------+
       |        r1                              country     tropen   year |
       |------------------------------------------------------------------|
    1. | -8.390036                              Nigeria   9.135846   1986 |
    2. | -5.954741                              Nigeria   19.49533   1987 |
    3. | -5.812572                             Mongolia   136.6038   1991 |
    4. | -5.788668                                Congo   57.14071   1992 |
    5. | -5.615585                              Nigeria   23.05924   1994 |
       |------------------------------------------------------------------|
    6. |  -5.54897   Venezuela (Bolivarian Republic of)   48.09081   2014 |
    7. | -5.364691                                Congo   93.50224   1986 |
    8. | -5.201165                              Nigeria   33.71975   1993 |
    9. | -5.149368           Iran (Islamic Republic of)   42.48267   1980 |
   10. | -5.119304                             Mongolia   129.7421   1993 |
       |------------------------------------------------------------------|
   11. |   -5.0325                              Lesotho   145.7225   1979 |
   12. | -4.991829                         Sierra Leone   33.74916   1999 |
   13. | -4.458163                               Angola   152.5471   2000 |
   14. | -4.440694                              Myanmar    11.8554   2012 |
   15. |  -4.35099                           Kyrgyzstan   71.82427   1995 |
       |------------------------------------------------------------------|
   16. | -4.317234                                 Iraq   69.59177   2015 |
   17. | -4.304833                                Congo   122.6936   2015 |
   18. | -4.225859                            Sri Lanka   79.46437   1979 |
   19. | -4.167251                                Niger   49.87572   1984 |
   20. | -4.034828                              Nigeria   16.94061   1988 |
       |------------------------------------------------------------------|
   21. | -3.984393                             Bulgaria   86.46374   1997 |
   22. | -3.973763                                Congo   148.5866   2007 |
   23. | -3.850984                                Benin   57.85733   1982 |
   24. | -3.848738                                Haiti   44.72187   2010 |
   25. | -3.833772                               Jordan   149.4534   1990 |
       |------------------------------------------------------------------|
   26. | -3.813656                           Kyrgyzstan   73.83021   1994 |
   27. | -3.746974                  Republic of Moldova   117.5279   1999 |
   28. | -3.712442                                Congo   148.9017   1998 |
   29. | -3.684884                              Nigeria   37.02161   1991 |
   30. | -3.639125                              Nigeria   10.04497   1983 |
       |------------------------------------------------------------------|
   31. | -3.624794                               Kuwait    142.613   1991 |
   32. | -3.594249                               Gambia    42.6397   2011 |
   33. | -3.584015                              Ukraine   73.94401   1994 |
   34. | -3.548523                              Bahrain   191.6102   1985 |
   35. |  -3.53601                                 Togo   56.47844   1993 |
       |------------------------------------------------------------------|
   36. |  -3.53057                              Nigeria   39.52838   1995 |
   37. | -3.529202                              Nigeria   34.18262   1989 |
   38. | -3.493545                                 Togo    86.7753   2005 |
   39. | -3.438717                               Kuwait    103.011   1990 |
   40. | -3.433974                              Armenia   112.4294   1994 |
       |------------------------------------------------------------------|
   41. | -3.379915                             Mongolia   77.97408   1996 |
   42. | -3.272099                                Sudan   28.12366   2012 |
   43. | -3.270095                              Burundi       35.1   2005 |
   44. | -3.246121                                 Togo   97.10271   1975 |
   45. | -3.226655                                Congo   130.7777   2016 |
       |------------------------------------------------------------------|
   46. | -3.226344                          El Salvador   67.40646   1980 |
   47. | -3.221584                           Kyrgyzstan   95.08401   2005 |
   48. | -3.194068                             Honduras    76.2204   1974 |
   49. |  -3.13579                                Congo   132.7363   1994 |
   50. | -3.131231                           Tajikistan   114.4801   2008 |
       |------------------------------------------------------------------|
   51. | -3.113965                              Ukraine    97.2297   1995 |
   52. | -3.110496                                 Mali   55.31162   2004 |
   53. | -3.109121                           Kyrgyzstan   84.47713   1997 |
   54. | -3.108056                             Mongolia   94.90463   1981 |
   55. | -3.097727                                 Togo   81.71684   2004 |
       |------------------------------------------------------------------|
   56. | -3.093025                                Haiti   45.75664   2017 |
   57. | -3.085844                              Lesotho   131.0919   1980 |
   58. |  -3.07729                                 Togo   99.19695   1981 |
   59. |  -3.07394                                 Mali   46.82693   1988 |
   60. | -3.049758                                 Peru   22.53676   1989 |
       |------------------------------------------------------------------|
   61. | -3.048726                         Sierra Leone   49.59553   1996 |
   62. | -3.030595                           Kyrgyzstan   74.70633   1993 |
   63. | -3.019061                               Angola   122.4461   2009 |
   64. |  -3.00577                          El Salvador   60.26649   1981 |
 4719. |  3.006821                              Iceland   82.68803   2008 |
       |------------------------------------------------------------------|
 4720. |  3.040936                         Saudi Arabia   83.98095   1976 |
 4721. |  3.082333                         Saudi Arabia   71.90112   1971 |
 4722. |   3.08312                               Kuwait    89.7131   2006 |
 4723. |  3.090278                               Kuwait   86.55518   2003 |
 4724. |  3.143881                        Côte d'Ivoire   53.68042   2014 |
       |------------------------------------------------------------------|
 4725. |  3.176243                              Nigeria   10.39198   1985 |
 4726. |  3.244319                              Myanmar    30.9831   2013 |
 4727. |  3.266466                            Argentina   21.50647   1996 |
 4728. |  3.269696                         Saudi Arabia   96.10265   2008 |
 4729. |   3.28925                             Mongolia   58.62189   1990 |
       |------------------------------------------------------------------|
 4730. |  3.311519                               Kuwait   99.09037   2011 |
 4731. |  3.324652                              Bahrain   148.3135   2005 |
 4732. |  3.444719                     China, Macao SAR   122.8884   2011 |
 4733. |  3.487671                     China, Macao SAR   119.9401   2010 |
 4734. |  3.550088                                Gabon    83.9496   2005 |
       |------------------------------------------------------------------|
 4735. |  3.554972                                 Mali   59.73471   1985 |
 4736. |  3.715055                         Saudi Arabia   85.54352   2011 |
 4737. |   3.73918                               Kuwait   92.24268   2005 |
 4738. |  3.835019                 Syrian Arab Republic     80.133   2005 |
 4739. |  3.859387                              Bahrain   135.8091   2000 |
       |------------------------------------------------------------------|
 4740. |  3.896209                                Malta   160.0243   1975 |
 4741. |  3.914661                                Congo   123.9099   2000 |
 4742. |  3.960318                                Gabon   86.99364   1989 |
 4743. |  4.045762                         Sierra Leone    87.4528   2013 |
 4744. |   4.64124                               Kuwait   92.05704   1993 |
       |------------------------------------------------------------------|
 4745. |  5.000248                              Nigeria   33.05946   2005 |
 4746. |  5.081958                                Qatar   98.72164   2011 |
 4747. |  5.385304                             Barbados   83.42039   1994 |
 4748. |  5.551443                               Kuwait   106.7868   1979 |
 4749. |  5.738859                              Ireland    215.164   2015 |
       |------------------------------------------------------------------|
 4750. |  6.207257                         Saudi Arabia    76.1384   1974 |
 4751. |  8.135962                             Zimbabwe   61.77844   2009 |
 4752. |  9.781103                               Kuwait   94.68806   1992 |
       +------------------------------------------------------------------+

. * The obersvation with r score greater then 3 is considered outlier and will
. * be ignored, the full list please see the list above.
. * For oil producing country, the outlier are siginifcant ar r1>=3, 2% of the obs
. * are outlier with r greater equal to 3, those will be excluded
. 
. *test serial correlation
. xtserial lngdp lntropen lnsaving grpop lnhc

Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
    F(  1,     138) =    852.833
           Prob > F =      0.0000

. 
. *The test score is 853, and we reject the null hypothesis that there
. *is no serial correlation. And there is serial correlation presented in
. *this model
. 
. *test for collinearity
. collin lntropen lnsaving grpop lnhc
(obs=4,752)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  lntropen      1.14    1.07    0.8768      0.1232
  lnsaving      1.12    1.06    0.8925      0.1075
     grpop      1.71    1.31    0.5843      0.4157
      lnhc      2.00    1.42    0.4992      0.5008
----------------------------------------------------
  Mean VIF      1.49

                           Cond
        Eigenval          Index
---------------------------------
    1     4.4389          1.0000
    2     0.4668          3.0838
    3     0.0467          9.7465
    4     0.0382         10.7802
    5     0.0094         21.6903
---------------------------------
 Condition Number        21.6903 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4754

. *Since all the VIF is less then 10, we faile to reject the null hypothesis
. *then there is no evidence of multicollineary in this model
. 
. *3Variable TOT graph
. twoway (scatter lngdp lntropen) (lfit lngdp lntropen), title("Natural log of GDP 
> per capita as a function of trade openness")

. graph export scatterlntropen.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scatterlntropen.png saved as
    PNG format

. twoway (scatter gdp tropen) (lfit gdp tropen), title("GDP per capita as a functio
> n of trade openness")

. graph export scattertropen.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/scattertropen.png saved as
    PNG format

. *5 all variables included
. xtpcse lngdp lntropen lnsaving grpop lnhc L1.lngdp i.year if abs(r)<=3, het corr(
> ar1)

Number of gaps in sample = 91
note: computations for rho restarted at each gap.

Prais–Winsten regression, heteroskedastic panels corrected standard errors

Group variable:   code                          Number of obs     =      4,634
Time variable:    year                          Number of groups  =        139
Panels:           heteroskedastic (unbalanced)  Obs per group:
Autocorrelation:  common AR(1)                                min =          6
                                                              avg =  33.338129
                                                              max =         59
Estimated covariances      =       139          R-squared         =     0.9973
Estimated autocorrelations =         1          Wald chi2(63)     = 1235816.59
Estimated coefficients     =        64          Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |            Het-corrected
       lngdp | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    lntropen |   .0088805   .0018038     4.92   0.000     .0053451    .0124158
    lnsaving |   .0167686    .001725     9.72   0.000     .0133876    .0201497
       grpop |  -.7255025   .1337016    -5.43   0.000    -.9875527   -.4634522
        lnhc |   .0282969   .0074545     3.80   0.000     .0136864    .0429074
             |
       lngdp |
         L1. |   .9809641   .0018491   530.51   0.000       .97734    .9845883
             |
        year |
       1962  |   -.000271   .0289061    -0.01   0.993    -.0569259    .0563838
       1963  |    .023572   .0331698     0.71   0.477    -.0414397    .0885837
       1964  |   .0275592   .0344096     0.80   0.423    -.0398825    .0950008
       1965  |   .0079417   .0347901     0.23   0.819    -.0602457    .0761291
       1966  |   .0092481    .034878     0.27   0.791    -.0591114    .0776077
       1967  |   .0356716   .0345849     1.03   0.302    -.0321135    .1034567
       1968  |   .0028375    .031113     0.09   0.927    -.0581429    .0638178
       1969  |   .0354351   .0290723     1.22   0.223    -.0215457    .0924158
       1970  |   .0474018   .0271094     1.75   0.080    -.0057318    .1005353
       1971  |   .0148743   .0266991     0.56   0.577     -.037455    .0672037
       1972  |   .0404862   .0269343     1.50   0.133    -.0123041    .0932765
       1973  |   .0549342   .0268788     2.04   0.041     .0022527    .1076157
       1974  |   .0246921   .0264035     0.94   0.350    -.0270578     .076442
       1975  |  -.0240769   .0259722    -0.93   0.354    -.0749815    .0268278
       1976  |    .025965   .0256189     1.01   0.311    -.0242472    .0761772
       1977  |   .0167043   .0255325     0.65   0.513    -.0333383     .066747
       1978  |  -.0023683    .025538    -0.09   0.926    -.0524218    .0476852
       1979  |   .0129712   .0255031     0.51   0.611    -.0370139    .0629563
       1980  |   .0085572   .0254907     0.34   0.737    -.0414037     .058518
       1981  |  -.0028265   .0254793    -0.11   0.912    -.0527651    .0471121
       1982  |    -.02044   .0254461    -0.80   0.422    -.0703135    .0294334
       1983  |  -.0123907   .0254402    -0.49   0.626    -.0622525    .0374711
       1984  |   .0028488   .0254435     0.11   0.911    -.0470196    .0527172
       1985  |  -.0030503   .0254193    -0.12   0.904    -.0528712    .0467707
       1986  |    .004707   .0253824     0.19   0.853    -.0450416    .0544556
       1987  |   .0002725   .0254127     0.01   0.991    -.0495355    .0500805
       1988  |    .002076   .0254176     0.08   0.935    -.0477416    .0518936
       1989  |  -.0004688   .0254155    -0.02   0.985    -.0502824    .0493447
       1990  |  -.0008097   .0253865    -0.03   0.975    -.0505663     .048947
       1991  |  -.0009092   .0253664    -0.04   0.971    -.0506264     .048808
       1992  |  -.0087729   .0253732    -0.35   0.730    -.0585035    .0409578
       1993  |  -.0000102   .0253532    -0.00   1.000    -.0497016    .0496811
       1994  |   .0200422   .0253569     0.79   0.429    -.0296565    .0697408
       1995  |   .0173879   .0252822     0.69   0.492    -.0321644    .0669401
       1996  |   .0126848   .0252812     0.50   0.616    -.0368655    .0622351
       1997  |   -.008741   .0252775    -0.35   0.729     -.058284    .0408021
       1998  |  -.0174651   .0252707    -0.69   0.489    -.0669948    .0320645
       1999  |   .0008108   .0252767     0.03   0.974    -.0487305    .0503521
       2000  |   .0136047   .0252665     0.54   0.590    -.0359167     .063126
       2001  |  -.0051897   .0252778    -0.21   0.837    -.0547333    .0443538
       2002  |   .0058274   .0252761     0.23   0.818    -.0437128    .0553677
       2003  |   .0082212   .0252637     0.33   0.745    -.0412947     .057737
       2004  |   .0288867   .0252508     1.14   0.253     -.020604    .0783773
       2005  |   .0411633   .0252301     1.63   0.103    -.0082867    .0906134
       2006  |   .0363136    .025234     1.44   0.150     -.013144    .0857713
       2007  |   .0311471    .025235     1.23   0.217    -.0183126    .0806067
       2008  |   .0239133    .025246     0.95   0.344    -.0255679    .0733944
       2009  |   -.029559   .0252285    -1.17   0.241     -.079006    .0198881
       2010  |   .0417578   .0252239     1.66   0.098    -.0076801    .0911957
       2011  |   .0427138   .0252223     1.69   0.090     -.006721    .0921487
       2012  |   .0091373   .0252423     0.36   0.717    -.0403367    .0586113
       2013  |  -.0167667   .0252437    -0.66   0.507    -.0662434    .0327099
       2014  |  -.0053113   .0252359    -0.21   0.833    -.0547728    .0441502
       2015  |  -.0089711   .0252167    -0.36   0.722    -.0583949    .0404528
       2016  |  -.0051187    .025228    -0.20   0.839    -.0545646    .0443272
       2017  |   .0153251   .0252325     0.61   0.544    -.0341297    .0647799
       2018  |   .0017641   .0252362     0.07   0.944     -.047698    .0512262
       2019  |  -.0076722     .02525    -0.30   0.761    -.0571613    .0418168
             |
       _cons |   .0939544    .029019     3.24   0.001     .0370782    .1508306
-------------+----------------------------------------------------------------
         rho |   .3167381
------------------------------------------------------------------------------

. 
. *6
. eststo clear

. quietly eststo:xtpcse lngdp lntropen i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lntropen lnsaving  i.year if abs(r)<=3, het corr(ar1)

. quietly eststo:xtpcse lngdp lntropen lnsaving grpop i.year if abs(r)<=3, het corr
> (ar1)

. quietly eststo:xtpcse lngdp lntropen lnsaving grpop lnhc i.year if abs(r)<=3, het
>  corr(ar1)

. quietly eststo:xtpcse lngdp lntropen lnsaving grpop lnhc L1.lngdp i.year if abs(r
> )<=3, het corr(ar1)

. esttab est1 est2 est3 est4 est5 using tropen.csv, star(* .10 ** .05 *** .01) se s
> tats(N r2) indicate("Year Dummies =*.year") replace
(file tropen.csv not found)
(output written to tropen.csv)

. 
. quietly eststo:xtpcse lngdp lntropen lnsaving grpop lnhc L1.lngdp i.year  if abs(
> r1)<=3&oilprofit>=0.1, het corr(ar1)

. esttab est5 est6 using tropenoil.csv, star(* .10 ** .05 *** .01) se stats(N r2) i
> ndicate("Year Dummies =*.year") replace
(file tropenoil.csv not found)
(output written to tropenoil.csv)

. 
. *5. Variable all 4
. use final, clear

. 
. gen lntot2=lntot^2
(5,544 missing values generated)

. 
. *fe
. xtreg lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpop lnhc L1.lngdp,
>  fe

Fixed-effects (within) regression               Number of obs     =      2,205
Group variable: code                            Number of groups  =        127

R-squared:                                      Obs per group:
     Within  = 0.9612                                         min =          1
     Between = 0.9990                                         avg =       17.4
     Overall = 0.9969                                         max =         31

                                                F(9,2069)         =    5699.91
corr(u_i, Xb) = 0.8035                          Prob > F          =     0.0000

------------------------------------------------------------------------------
       lngdp | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lntot |   .1158289   .0835456     1.39   0.166    -.0480133    .2796711
      lntot2 |  -.0060877    .008837    -0.69   0.491     -.023418    .0112426
    lntariff |  -.0092072   .0038177    -2.41   0.016    -.0166942   -.0017202
    lnfdiout |   .0001417   .0000999     1.42   0.156    -.0000542    .0003375
    lntropen |   .0405743   .0078407     5.17   0.000     .0251979    .0559508
    lnsaving |   .0213342     .00361     5.91   0.000     .0142546    .0284138
       grpop |   -.110709   .2892498    -0.38   0.702    -.6779601    .4565421
        lnhc |   .1048467   .0287299     3.65   0.000     .0485043    .1611892
             |
       lngdp |
         L1. |   .9176386   .0066497   138.00   0.000     .9045979    .9306794
             |
       _cons |   .0752746    .215336     0.35   0.727    -.3470233    .4975725
-------------+----------------------------------------------------------------
     sigma_u |   .0657115
     sigma_e |  .05489434
         rho |  .58897442   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(126, 2069) = 2.97                   Prob > F = 0.0000

. 
. *test for year fix effect
. quietly xtreg lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpop lnhc L
> 1.lngdp i.year, fe

. testparm i.year

 ( 1)  1989.year = 0
 ( 2)  1990.year = 0
 ( 3)  1991.year = 0
 ( 4)  1992.year = 0
 ( 5)  1993.year = 0
 ( 6)  1994.year = 0
 ( 7)  1995.year = 0
 ( 8)  1996.year = 0
 ( 9)  1997.year = 0
 (10)  1998.year = 0
 (11)  1999.year = 0
 (12)  2000.year = 0
 (13)  2001.year = 0
 (14)  2002.year = 0
 (15)  2003.year = 0
 (16)  2004.year = 0
 (17)  2005.year = 0
 (18)  2006.year = 0
 (19)  2007.year = 0
 (20)  2008.year = 0
 (21)  2009.year = 0
 (22)  2010.year = 0
 (23)  2011.year = 0
 (24)  2012.year = 0
 (25)  2013.year = 0
 (26)  2014.year = 0
 (27)  2015.year = 0
 (28)  2016.year = 0
 (29)  2017.year = 0
 (30)  2018.year = 0
 (31)  2019.year = 0

       F( 31,  2038) =   13.69
            Prob > F =    0.0000

. **The score is 13.69 where we reject the null hypothesis that coefficietns 
. *on dummies for year is equal to 0. Therefore we need to include
. *year fixed effect
. 
. *test homoskedasticity
. quietly xtreg lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpop lnhc L
> 1.lngdp, fe

. xttest3

Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

H0: sigma(i)^2 = sigma^2 for all i

chi2 (127)  =   1.4e+05
Prob>chi2 =      0.0000


. *The result is 140000 and we reject the null hypothesis that this model
. *is homoskedasticity, therefore the residuals are heteroskedastic.
. 
. *Outliers
. quietly xtreg lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpop lnhc L
> 1.lngdp i.year, fe

. predict r, rstudent
(8,475 missing values generated)

. quietly xtreg lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpop lnhc L
> 1.lngdp i.year if oilprofit>=0.1, fe

. predict r1, rstudent
(8,475 missing values generated)

. sort r

. list r country year tot tariff fdiout tropen if abs(r)>4 & r!=.

       +--------------------------------------------------------------------------+
    1. |         r |                            country | year |     tot | tariff |
       | -9.464224 | Venezuela (Bolivarian Republic of) | 2014 |  398.96 |  11.03 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              4.536e+09              |              48.09081              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    2. |         r |                            country | year |     tot | tariff |
       | -8.109149 |                              Congo | 2015 | 173.707 |  12.91 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5.492e+08              |              122.6936              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    3. |         r |                            country | year |     tot | tariff |
       | -6.936193 |                            Nigeria | 1988 | 60.9375 |  25.93 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5060999.9              |              16.94061              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    4. |         r |                            country | year |     tot | tariff |
       | -6.788622 |                              Congo | 2007 | 179.117 |  18.24 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -45258718              |              148.5866              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    5. |         r |                            country | year |     tot | tariff |
       | -6.553566 |                            Nigeria | 1995 | 55.5556 |  87.19 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.918e+08              |              39.52838              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    6. |         r |                            country | year |     tot | tariff |
       |  -6.02649 |                             Angola | 2009 | 164.394 |   7.77 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              6753124.6              |              122.4461              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    7. |         r |                            country | year |     tot | tariff |
       | -5.812649 |                             Gambia | 2011 | 102.915 |  15.58 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -58264987              |               42.6397              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    8. |         r |                            country | year |     tot | tariff |
       | -5.696726 |                  D.R. of the Congo | 2008 | 132.556 |  12.92 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               54100000              |              83.77229              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    9. |         r |                            country | year |     tot | tariff |
       | -5.692027 |                            Nigeria | 1996 | 86.9048 |  22.95 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5.972e+08              |              40.25773              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   10. |         r |                            country | year |     tot | tariff |
       | -5.576911 |                            Burundi | 2018 | 162.766 |  11.24 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |                 5.6089              |              39.21004              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   11. |         r |                            country | year |     tot | tariff |
       | -5.489703 |                            Nigeria | 1989 | 75.7143 |  27.83 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              7.977e+08              |              34.18262              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   12. |         r |                            country | year |     tot | tariff |
       | -5.477387 |                               Mali | 2004 | 114.223 |  13.64 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -15379961              |              55.31162              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   13. |         r |                            country | year |     tot | tariff |
       | -5.354367 |                            Nigeria | 1992 | 65.0406 |  28.13 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2.601e+08              |              38.22739              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   14. |         r |                            country | year |     tot | tariff |
       |  -5.35054 |                              Congo | 2009 | 150.243 |   18.2 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -89543049              |              135.5524              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   15. |         r |                            country | year |     tot | tariff |
       | -5.310252 |                              Niger | 2004 | 117.418 |   14.1 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               11140862              |               36.9641              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   16. |         r |                            country | year |     tot | tariff |
       | -5.297105 |                         Mozambique | 2010 | 104.161 |   8.77 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2.379e+08              |               70.6407              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   17. |         r |                            country | year |     tot | tariff |
       | -5.296368 |                              Niger | 2011 | 188.528 |  13.14 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              9298700.9              |               50.2464              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   18. |         r |                            country | year |     tot | tariff |
       | -5.216751 |                              Niger | 2007 | 220.765 |  12.71 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -22071157              |               35.5028              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   19. |         r |                            country | year |     tot | tariff |
       | -5.213158 |                         Mozambique | 2018 | 104.501 |   8.96 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -25304880              |              127.2042              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   20. |         r |                            country | year |     tot | tariff |
       | -5.130586 |                             Kuwait | 2015 | 121.773 |   3.86 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5.440e+09              |              98.69957              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   21. |         r |                            country | year |     tot | tariff |
       | -5.101271 |                              Congo | 1994 | 53.5714 |  20.49 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |                -912000              |              132.7363              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   22. |         r |                            country | year |     tot | tariff |
       | -5.083378 |                            Burundi | 2007 | 119.644 |  13.54 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              35031.946              |                  38.8              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   23. |         r |                            country | year |     tot | tariff |
       | -5.080769 |                              Niger | 2015 | 177.013 |  10.73 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               34138533              |              44.72743              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   24. |         r |                            country | year |     tot | tariff |
       | -5.003488 |                  D.R. of the Congo | 2006 | 117.962 |  13.05 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               18400000              |              47.96326              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   25. |         r |                            country | year |     tot | tariff |
       | -4.988744 |                              Niger | 2013 | 193.887 |  13.29 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.008e+08              |              46.29515              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   26. |         r |                            country | year |     tot | tariff |
       | -4.914284 |                         Mozambique | 2011 | 102.509 |  10.75 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               83588479              |              80.23035              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   27. |         r |                            country | year |     tot | tariff |
       | -4.839603 |                            Burundi | 2015 | 159.066 |  10.42 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              152172.69              |              32.54195              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   28. |         r |                            country | year |     tot | tariff |
       | -4.802576 |                              Niger | 2017 | 164.407 |  13.27 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               29088786              |              39.55926              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   29. |         r |                            country | year |     tot | tariff |
       |   -4.7753 |                            Nigeria | 1990 | 88.5057 |  28.02 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              4.146e+08              |              30.92474              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   30. |         r |                            country | year |     tot | tariff |
       | -4.722515 |                               Togo | 2007 | 100.969 |  13.85 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               12475093              |              85.88074              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   31. |         r |                            country | year |     tot | tariff |
       | -4.707665 |                              Niger | 2016 | 163.058 |  10.84 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               40212241              |              36.48811              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   32. |         r |                            country | year |     tot | tariff |
       | -4.671277 |                              Niger | 2006 | 156.653 |   12.8 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -11259019              |              36.53137              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   33. |         r |                            country | year |     tot | tariff |
       | -4.547787 |                               Togo | 2000 |     100 |  14.35 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               11243185              |              68.66603              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   34. |         r |                            country | year |     tot | tariff |
       | -4.534059 |                             Zambia | 2015 | 169.756 |  10.64 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -1.416e+08              |              79.86542              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   35. |         r |                            country | year |     tot | tariff |
       | -4.489074 |                               Togo | 2006 | 96.1652 |  14.15 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -423026.72              |                87.006              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   36. |         r |                            country | year |     tot | tariff |
       | -4.489054 |                              Gabon | 2009 | 160.291 |  18.48 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2.435e+08              |              83.50458              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   37. |         r |                            country | year |     tot | tariff |
       | -4.450032 |                              Niger | 2019 | 159.732 |  12.18 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               32027560              |              37.71437              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   38. |         r |                            country | year |     tot | tariff |
       | -4.425987 |                              Niger | 2010 | 176.183 |   12.8 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -2.044e+08              |              51.94599              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   39. |         r |                            country | year |     tot | tariff |
       | -4.414442 |                         Mozambique | 2016 | 91.3446 |   7.16 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               34720696              |              105.6385              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   40. |         r |                            country | year |     tot | tariff |
       | -4.321216 |                  D.R. of the Congo | 2019 |  110.57 |  12.02 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.339e+08              |              56.62016              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   41. |         r |                            country | year |     tot | tariff |
       | -4.317712 |                              Niger | 2005 |  134.52 |  14.27 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               15024892              |              38.34774              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   42. |         r |                            country | year |     tot | tariff |
       | -4.315357 |                             Zambia | 2012 | 190.754 |  11.12 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -7.019e+08              |              79.10071              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   43. |         r |                            country | year |     tot | tariff |
       | -4.266517 |                              Niger | 2014 | 184.779 |  13.17 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               88660962              |               45.7416              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   44. |         r |                            country | year |     tot | tariff |
       |  -4.25353 |                               Mali | 2012 | 174.405 |  12.29 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               15950181              |              59.12059              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   45. |         r |                            country | year |     tot | tariff |
       | -4.245168 |                             Uganda | 2012 | 111.339 |  12.23 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               46337028              |              43.50214              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   46. |         r |                            country | year |     tot | tariff |
       | -4.214273 |                             Uganda | 2016 | 122.939 |  11.71 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               145397.7              |              31.20936              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   47. |         r |                            country | year |     tot | tariff |
       | -4.208469 |                         Madagascar | 2018 |  67.085 |   9.25 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.179e+08              |              67.84151              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   48. |         r |                            country | year |     tot | tariff |
       | -4.153555 |                            Burundi | 2016 | 172.023 |  10.43 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              36443.266              |              31.74422              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   49. |         r |                            country | year |     tot | tariff |
       |  -4.14753 |                               Mali | 2007 | 115.021 |  12.88 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.406e+08              |              56.64975              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   50. |         r |                            country | year |     tot | tariff |
       | -4.141758 |                              Niger | 2009 | 171.914 |  12.71 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -94991760              |              49.51226              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   51. |         r |                            country | year |     tot | tariff |
       |  -4.08521 |                  D.R. of the Congo | 2007 | 116.636 |  12.94 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               14300000              |              80.14205              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   52. |         r |                            country | year |     tot | tariff |
       | -4.069567 |                               Togo | 2010 | 112.192 |  13.53 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               76375178              |              91.20367              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   53. |         r |                            country | year |     tot | tariff |
       | -4.068406 |                              Congo | 2001 | 90.1006 |  19.64 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -2.067e+08              |              130.7325              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   54. |         r |                            country | year |     tot | tariff |
       | -4.025435 |                              Benin | 2010 | 127.373 |  12.83 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -1.414e+08              |              51.43086              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   55. |         r |                            country | year |     tot | tariff |
       | -4.019484 |                         Mauritania | 2014 | 146.433 |  12.34 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               27745000              |              91.61037              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2190. |         r |                            country | year |     tot | tariff |
       |  4.478276 |                            Ireland | 2019 | 91.6557 |   2.55 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -1.441e+11              |              252.3351              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2191. |         r |                            country | year |     tot | tariff |
       |  4.528429 |                             Kuwait | 2006 | 156.085 |   4.29 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              8.211e+09              |               89.7131              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2192. |         r |                            country | year |     tot | tariff |
       |   4.58795 |                            Iceland | 2008 | 87.9314 |   3.55 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -3.779e+09              |              82.68803              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2193. |         r |                            country | year |     tot | tariff |
       |  4.626575 |                            Bahrain | 2005 | 125.798 |   4.53 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.135e+09              |              148.3135              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2194. |         r |                            country | year |     tot | tariff |
       |  4.862451 |                          Argentina | 1996 |     100 |  14.45 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.601e+09              |              21.50647              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2195. |         r |                            country | year |     tot | tariff |
       |  4.878282 |                       Saudi Arabia | 2008 | 148.203 |   3.33 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3.498e+09              |              96.10265              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2196. |         r |                            country | year |     tot | tariff |
       |  4.901622 |                             Kuwait | 2011 | 194.406 |   4.62 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.077e+10              |              99.09037              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2197. |         r |                            country | year |     tot | tariff |
       |  5.185266 |                             Kuwait | 2004 | 119.526 |   4.82 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2.581e+09              |              89.29764              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2198. |         r |                            country | year |     tot | tariff |
       |   5.22745 |                             Kuwait | 2003 | 100.978 |   4.82 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -4.960e+09              |              86.55518              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2199. |         r |                            country | year |     tot | tariff |
       |  5.348574 |                              Gabon | 2005 | 154.994 |  19.65 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.592e+08              |               83.9496              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2200. |         r |                            country | year |     tot | tariff |
       |  5.668877 |                            Bahrain | 2000 |     100 |   8.45 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              9552708.3              |              135.8091              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2201. |         r |                            country | year |     tot | tariff |
       |  5.944217 |                       Saudi Arabia | 2011 | 148.267 |   4.83 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3.430e+09              |              85.54352              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2202. |         r |                            country | year |     tot | tariff |
       |  6.028555 |                             Kuwait | 2005 | 139.686 |   4.31 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5.142e+09              |              92.24268              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2203. |         r |                            country | year |     tot | tariff |
       |  7.374297 |                            Nigeria | 2005 |  156.29 |  10.55 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               14635077              |              33.05946              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2204. |         r |                            country | year |     tot | tariff |
       |  7.402549 |                              Qatar | 2011 | 213.837 |   4.78 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.011e+10              |              98.72164              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2205. |         r |                            country | year |     tot | tariff |
       |  8.053064 |                            Ireland | 2015 | 96.6819 |   2.73 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.896e+11              |               215.164              |
       +--------------------------------------------------------------------------+

. sort r1

. list r1 country year tot tariff fdiout tropen if abs(r1)>4 & r1!=.

       +--------------------------------------------------------------------------+
    1. |        r1 |                            country | year |     tot | tariff |
       | -7.948526 |                              Niger | 2011 | 188.528 |  13.14 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              9298700.9              |               50.2464              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    2. |        r1 |                            country | year |     tot | tariff |
       |  -7.58469 |                              Niger | 2007 | 220.765 |  12.71 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -22071157              |               35.5028              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    3. |        r1 |                            country | year |     tot | tariff |
       | -7.557954 | Venezuela (Bolivarian Republic of) | 2014 |  398.96 |  11.03 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              4.536e+09              |              48.09081              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    4. |        r1 |                            country | year |     tot | tariff |
       | -7.427852 |                            Burundi | 2018 | 162.766 |  11.24 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |                 5.6089              |              39.21004              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    5. |        r1 |                            country | year |     tot | tariff |
       | -7.345294 |                              Niger | 2017 | 164.407 |  13.27 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               29088786              |              39.55926              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    6. |        r1 |                            country | year |     tot | tariff |
       | -7.259442 |                              Niger | 2004 | 117.418 |   14.1 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               11140862              |               36.9641              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    7. |        r1 |                            country | year |     tot | tariff |
       | -7.069711 |                            Nigeria | 1988 | 60.9375 |  25.93 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5060999.9              |              16.94061              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    8. |        r1 |                            country | year |     tot | tariff |
       | -7.008242 |                              Niger | 2013 | 193.887 |  13.29 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.008e+08              |              46.29515              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
    9. |        r1 |                            country | year |     tot | tariff |
       | -6.745213 |                              Niger | 2019 | 159.732 |  12.18 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               32027560              |              37.71437              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   10. |        r1 |                            country | year |     tot | tariff |
       | -6.662513 |                              Niger | 2016 | 163.058 |  10.84 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               40212241              |              36.48811              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   11. |        r1 |                            country | year |     tot | tariff |
       | -6.599169 |                         Mozambique | 2010 | 104.161 |   8.77 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2.379e+08              |               70.6407              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   12. |        r1 |                            country | year |     tot | tariff |
       | -6.598436 |                              Niger | 2010 | 176.183 |   12.8 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -2.044e+08              |              51.94599              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   13. |        r1 |                            country | year |     tot | tariff |
       | -6.544948 |                            Burundi | 2007 | 119.644 |  13.54 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              35031.946              |                  38.8              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   14. |        r1 |                            country | year |     tot | tariff |
       | -6.538401 |                              Niger | 2006 | 156.653 |   12.8 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -11259019              |              36.53137              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   15. |        r1 |                            country | year |     tot | tariff |
       | -6.528864 |                               Mali | 2004 | 114.223 |  13.64 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -15379961              |              55.31162              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   16. |        r1 |                            country | year |     tot | tariff |
       | -6.424128 |                         Mozambique | 2018 | 104.501 |   8.96 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -25304880              |              127.2042              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   17. |        r1 |                            country | year |     tot | tariff |
       | -6.340649 |                              Congo | 2015 | 173.707 |  12.91 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5.492e+08              |              122.6936              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   18. |        r1 |                            country | year |     tot | tariff |
       | -6.259735 |                              Niger | 2005 |  134.52 |  14.27 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               15024892              |              38.34774              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   19. |        r1 |                            country | year |     tot | tariff |
       | -6.239713 |                  D.R. of the Congo | 2008 | 132.556 |  12.92 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               54100000              |              83.77229              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   20. |        r1 |                            country | year |     tot | tariff |
       |  -6.21253 |                            Nigeria | 1996 | 86.9048 |  22.95 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5.972e+08              |              40.25773              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   21. |        r1 |                            country | year |     tot | tariff |
       | -6.211001 |                              Niger | 2018 | 162.214 |  13.08 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               38617403              |              38.13411              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   22. |        r1 |                            country | year |     tot | tariff |
       | -6.205423 |                         Mozambique | 2011 | 102.509 |  10.75 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               83588479              |              80.23035              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   23. |        r1 |                            country | year |     tot | tariff |
       | -6.120603 |                              Niger | 2015 | 177.013 |  10.73 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               34138533              |              44.72743              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   24. |        r1 |                            country | year |     tot | tariff |
       | -6.054737 |                              Congo | 2007 | 179.117 |  18.24 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -45258718              |              148.5866              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   25. |        r1 |                            country | year |     tot | tariff |
       | -6.052776 |                            Nigeria | 1995 | 55.5556 |  87.19 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.918e+08              |              39.52838              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   26. |        r1 |                            country | year |     tot | tariff |
       | -5.991285 |                             Gambia | 2011 | 102.915 |  15.58 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -58264987              |               42.6397              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   27. |        r1 |                            country | year |     tot | tariff |
       | -5.730409 |                              Niger | 2014 | 184.779 |  13.17 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               88660962              |               45.7416              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   28. |        r1 |                            country | year |     tot | tariff |
       | -5.626128 |                  D.R. of the Congo | 2006 | 117.962 |  13.05 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               18400000              |              47.96326              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   29. |        r1 |                            country | year |     tot | tariff |
       | -5.468207 |                              Niger | 2008 | 177.435 |   12.7 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -34257844              |              39.71124              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   30. |        r1 |                            country | year |     tot | tariff |
       | -5.465389 |                            Burundi | 2015 | 159.066 |  10.42 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              152172.69              |              32.54195              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   31. |        r1 |                            country | year |     tot | tariff |
       | -5.306807 |                            Burundi | 2016 | 172.023 |  10.43 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              36443.266              |              31.74422              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   32. |        r1 |                            country | year |     tot | tariff |
       | -5.295465 |                            Nigeria | 1989 | 75.7143 |  27.83 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              7.977e+08              |              34.18262              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   33. |        r1 |                            country | year |     tot | tariff |
       | -5.146325 |                             Angola | 2009 | 164.394 |   7.77 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              6753124.6              |              122.4461              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   34. |        r1 |                            country | year |     tot | tariff |
       | -4.989403 |                              Niger | 2009 | 171.914 |  12.71 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -94991760              |              49.51226              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   35. |        r1 |                            country | year |     tot | tariff |
       | -4.866195 |                            Nigeria | 1992 | 65.0406 |  28.13 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2.601e+08              |              38.22739              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   36. |        r1 |                            country | year |     tot | tariff |
       | -4.834749 |                               Mali | 2012 | 174.405 |  12.29 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               15950181              |              59.12059              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   37. |        r1 |                            country | year |     tot | tariff |
       | -4.810223 |                            Nigeria | 1990 | 88.5057 |  28.02 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              4.146e+08              |              30.92474              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   38. |        r1 |                            country | year |     tot | tariff |
       | -4.726107 |                            Burundi | 2008 | 131.793 |  12.79 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              581517.53              |                  47.2              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   39. |        r1 |                            country | year |     tot | tariff |
       |   -4.6131 |                            Burundi | 2003 | 85.4286 |  22.02 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -4618.4257              |              27.37631              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   40. |        r1 |                            country | year |     tot | tariff |
       | -4.604938 |                               Togo | 2000 |     100 |  14.35 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               11243185              |              68.66603              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   41. |        r1 |                            country | year |     tot | tariff |
       | -4.580864 |                              Niger | 2003 | 105.807 |  14.24 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3586841.2              |              33.38279              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   42. |        r1 |                            country | year |     tot | tariff |
       | -4.574575 |                  D.R. of the Congo | 2019 |  110.57 |  12.02 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.339e+08              |              56.62016              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   43. |        r1 |                            country | year |     tot | tariff |
       | -4.553147 |                               Mali | 2007 | 115.021 |  12.88 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.406e+08              |              56.64975              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   44. |        r1 |                            country | year |     tot | tariff |
       | -4.538517 |                  D.R. of the Congo | 2010 | 123.842 |  11.87 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |                7200000              |              90.74761              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   45. |        r1 |                            country | year |     tot | tariff |
       |  -4.53839 |                         Mozambique | 2016 | 91.3446 |   7.16 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               34720696              |              105.6385              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   46. |        r1 |                            country | year |     tot | tariff |
       | -4.517932 |                               Mali | 2010 | 162.784 |  12.67 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -26934421              |               57.9853              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   47. |        r1 |                            country | year |     tot | tariff |
       | -4.466614 |                  D.R. of the Congo | 2007 | 116.636 |  12.94 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               14300000              |              80.14205              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   48. |        r1 |                            country | year |     tot | tariff |
       | -4.465961 |                               Togo | 2007 | 100.969 |  13.85 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               12475093              |              85.88074              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   49. |        r1 |                            country | year |     tot | tariff |
       | -4.463643 |                             Uganda | 2012 | 111.339 |  12.23 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               46337028              |              43.50214              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   50. |        r1 |                            country | year |     tot | tariff |
       | -4.354285 |                              Congo | 2009 | 150.243 |   18.2 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              -89543049              |              135.5524              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   51. |        r1 |                            country | year |     tot | tariff |
       | -4.329605 |                         Mozambique | 2008 | 106.945 |  10.78 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               49752005              |              62.33313              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   52. |        r1 |                            country | year |     tot | tariff |
       |  -4.31777 |                         Kyrgyzstan | 2010 | 119.629 |   3.26 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               17615900              |              133.2328              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   53. |        r1 |                            country | year |     tot | tariff |
       | -4.311954 |                              Benin | 2010 | 127.373 |  12.83 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -1.414e+08              |              51.43086              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   54. |        r1 |                            country | year |     tot | tariff |
       | -4.261506 |                             Zambia | 2012 | 190.754 |  11.12 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -7.019e+08              |              79.10071              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   55. |        r1 |                            country | year |     tot | tariff |
       | -4.249906 |                         Mozambique | 2006 | 122.138 |  12.13 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.381e+08              |              64.09237              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   56. |        r1 |                            country | year |     tot | tariff |
       | -4.243189 |                               Togo | 2006 | 96.1652 |  14.15 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -423026.72              |                87.006              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   57. |        r1 |                            country | year |     tot | tariff |
       | -4.221969 |                               Togo | 2010 | 112.192 |  13.53 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               76375178              |              91.20367              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   58. |        r1 |                            country | year |     tot | tariff |
       | -4.219479 |                             Uganda | 2016 | 122.939 |  11.71 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               145397.7              |              31.20936              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   59. |        r1 |                            country | year |     tot | tariff |
       | -4.202436 |                            Burundi | 2013 | 154.247 |   9.99 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              166742.67              |              46.60001              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   60. |        r1 |                            country | year |     tot | tariff |
       | -4.192007 |                              Niger | 2012 | 198.417 |  13.13 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2183892.2              |              45.08596              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   61. |        r1 |                            country | year |     tot | tariff |
       | -4.171708 |                       Burkina Faso | 2011 | 138.272 |  12.32 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.024e+08              |              57.49725              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
   62. |        r1 |                            country | year |     tot | tariff |
       | -4.131219 |                         Mozambique | 2007 | 116.183 |  10.99 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               17377368              |              63.03715              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2182. |        r1 |                            country | year |     tot | tariff |
       |  4.051931 |                         Luxembourg | 2011 | 77.9073 |    2.3 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.072e+10              |              308.7144              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2183. |        r1 |                            country | year |     tot | tariff |
       |   4.06532 |                         Luxembourg | 2006 | 85.8447 |   2.75 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.004e+10              |              305.8795              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2184. |        r1 |                            country | year |     tot | tariff |
       |  4.146123 |                            Bahrain | 2005 | 125.798 |   4.53 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.135e+09              |              148.3135              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2185. |        r1 |                            country | year |     tot | tariff |
       |  4.174999 |                          Argentina | 1996 |     100 |  14.45 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.601e+09              |              21.50647              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2186. |        r1 |                            country | year |     tot | tariff |
       |  4.259558 |                       Saudi Arabia | 2008 | 148.203 |   3.33 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3.498e+09              |              96.10265              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2187. |        r1 |                            country | year |     tot | tariff |
       |  4.351909 |                         Luxembourg | 2019 | 70.0459 |   2.55 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3.447e+10              |              380.1042              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2188. |        r1 |                            country | year |     tot | tariff |
       |  4.468597 |                            Iceland | 2008 | 87.9314 |   3.55 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -3.779e+09              |              82.68803              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2189. |        r1 |                            country | year |     tot | tariff |
       |  4.506114 |                             Kuwait | 2006 | 156.085 |   4.29 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              8.211e+09              |               89.7131              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2190. |        r1 |                            country | year |     tot | tariff |
       |  4.520099 |                           Malaysia | 1988 | 88.8889 |   18.6 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.983e+08              |              122.6242              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2191. |        r1 |                            country | year |     tot | tariff |
       |  4.540727 |                             Kuwait | 2011 | 194.406 |   4.62 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.077e+10              |              99.09037              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2192. |        r1 |                            country | year |     tot | tariff |
       |  4.582239 |                              Gabon | 2005 | 154.994 |  19.65 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.592e+08              |               83.9496              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2193. |        r1 |                            country | year |     tot | tariff |
       |  4.655839 |                         Luxembourg | 2016 | 73.7701 |   2.48 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3.017e+10              |              348.4374              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2194. |        r1 |                            country | year |     tot | tariff |
       |  4.864627 |                             Kuwait | 2004 | 119.526 |   4.82 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              2.581e+09              |              89.29764              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2195. |        r1 |                            country | year |     tot | tariff |
       |  4.956969 |                         Luxembourg | 2014 | 73.4594 |   2.76 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3.440e+10              |              333.4289              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2196. |        r1 |                            country | year |     tot | tariff |
       |  4.993752 |                             Kuwait | 2003 | 100.978 |   4.82 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -4.960e+09              |              86.55518              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2197. |        r1 |                            country | year |     tot | tariff |
       |  5.086875 |                            Ireland | 2019 | 91.6557 |   2.55 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |             -1.441e+11              |              252.3351              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2198. |        r1 |                            country | year |     tot | tariff |
       |   5.11636 |                            Bahrain | 2000 |     100 |   8.45 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              9552708.3              |              135.8091              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2199. |        r1 |                            country | year |     tot | tariff |
       |  5.117112 |                       Saudi Arabia | 2011 | 148.267 |   4.83 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              3.430e+09              |              85.54352              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2200. |        r1 |                            country | year |     tot | tariff |
       |  5.307195 |                         Luxembourg | 2015 | 75.7499 |   2.73 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.731e+10              |               351.132              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2201. |        r1 |                            country | year |     tot | tariff |
       |  5.530855 |                  Republic of Korea | 1988 | 138.053 |  18.83 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              7.260e+08              |              58.70364              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2202. |        r1 |                            country | year |     tot | tariff |
       |  5.556083 |                             Kuwait | 2005 | 139.686 |   4.31 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              5.142e+09              |              92.24268              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2203. |        r1 |                            country | year |     tot | tariff |
       |  6.006023 |                            Nigeria | 2005 |  156.29 |  10.55 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |               14635077              |              33.05946              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2204. |        r1 |                            country | year |     tot | tariff |
       |  7.258251 |                              Qatar | 2011 | 213.837 |   4.78 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.011e+10              |              98.72164              |
       +--------------------------------------------------------------------------+

       +--------------------------------------------------------------------------+
 2205. |        r1 |                            country | year |     tot | tariff |
       |  8.995679 |                            Ireland | 2015 | 96.6819 |   2.73 |
       |--------------------------------------------------------------------------|
       |                 fdiout              |                tropen              |
       |              1.896e+11              |               215.164              |
       +--------------------------------------------------------------------------+

. * The obersvation with r score greater then 4 is considered outlier since there
. * are many variables need to be considered so will tend to vary more and will
. * be ignored, the full list please see the list above.
. * For oil producing country, the outlier are siginifcant ar r1>=4, 13% of the obs
. * are outlier with r1 greater equal to 4, those will be excluded
. 
. *test serial correlation
. xtserial lngdp lntot lntariff lnfdiout lntropen lnsaving grpop lnhc

Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
    F(  1,     119) =    731.167
           Prob > F =      0.0000

. 
. *The test score is 731, and we reject the null hypothesis that there
. *is no serial correlation. And there is serial correlation presented in
. *this model
. 
. *test for collinearity
. collin lntot lntariff lnfdiout lntropen lnsaving grpop lnhc
(obs=2,205)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
     lntot      1.07    1.04    0.9321      0.0679
  lntariff      1.82    1.35    0.5481      0.4519
  lnfdiout      1.06    1.03    0.9397      0.0603
  lntropen      1.32    1.15    0.7559      0.2441
  lnsaving      1.10    1.05    0.9116      0.0884
     grpop      1.72    1.31    0.5824      0.4176
      lnhc      2.22    1.49    0.4505      0.5495
----------------------------------------------------
  Mean VIF      1.47

                           Cond
        Eigenval          Index
---------------------------------
    1     6.8260          1.0000
    2     0.5858          3.4136
    3     0.3664          4.3161
    4     0.1582          6.5678
    5     0.0296         15.1804
    6     0.0246         16.6719
    7     0.0080         29.1934
    8     0.0014         70.2450
---------------------------------
 Condition Number        70.2450 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.2567

. *Since all the VIF is less then 10 except the squred lntot, we failed to reject
. *the null hypothesis then there is no evidence of multicollineary in this model
. 
. *5 all variables included
. xtpcse lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpop lnhc L1.lngdp
>  i.year if abs(r)<=4, het corr(ar1)

Number of gaps in sample = 190
note: computations for rho restarted at each gap.
note: estimates of rho outside [-1,1] bounded to be in the range [-1,1].

Prais–Winsten regression, heteroskedastic panels corrected standard errors

Group variable:   code                          Number of obs     =      2,134
Time variable:    year                          Number of groups  =        127
Panels:           heteroskedastic (unbalanced)  Obs per group:
Autocorrelation:  common AR(1)                                min =          1
                                                              avg =   16.80315
                                                              max =         31
Estimated covariances      =       127          R-squared         =     0.9985
Estimated autocorrelations =         1          Wald chi2(40)     =  744885.76
Estimated coefficients     =        41          Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |            Het-corrected
       lngdp | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lntot |   .0940974   .0952955     0.99   0.323    -.0926783    .2808731
      lntot2 |   -.005735   .0102709    -0.56   0.577    -.0258655    .0143955
    lntariff |  -.0071105   .0021458    -3.31   0.001    -.0113162   -.0029048
    lnfdiout |   .0001018   .0000736     1.38   0.166    -.0000424     .000246
    lntropen |   .0090652   .0025162     3.60   0.000     .0041335    .0139969
    lnsaving |   .0136308   .0029373     4.64   0.000     .0078737    .0193879
       grpop |  -.6477551   .1812211    -3.57   0.000    -1.002942   -.2925682
        lnhc |   .0292778   .0101188     2.89   0.004     .0094454    .0491102
             |
       lngdp |
         L1. |   .9751133   .0026287   370.95   0.000     .9699611    .9802654
             |
        year |
       1989  |  -.0184406   .0184666    -1.00   0.318    -.0546344    .0177532
       1990  |  -.0277446   .0184512    -1.50   0.133    -.0639082    .0084191
       1991  |   -.020713   .0181933    -1.14   0.255    -.0563713    .0149453
       1992  |  -.0049623   .0191352    -0.26   0.795    -.0424666    .0325421
       1993  |  -.0215024   .0177755    -1.21   0.226    -.0563417    .0133369
       1994  |  -.0120082   .0182808    -0.66   0.511    -.0478378    .0238215
       1995  |   .0003692   .0173943     0.02   0.983     -.033723    .0344613
       1996  |  -.0134343   .0171168    -0.78   0.433    -.0469826     .020114
       1997  |  -.0515527    .017373    -2.97   0.003    -.0856031   -.0175022
       1998  |  -.0805776   .0172877    -4.66   0.000    -.1144609   -.0466942
       1999  |  -.0633601   .0168812    -3.75   0.000    -.0964467   -.0302735
       2000  |  -.0307112   .0161329    -1.90   0.057    -.0623312    .0009087
       2001  |   -.048313   .0160096    -3.02   0.003    -.0796912   -.0169347
       2002  |  -.0389174   .0161381    -2.41   0.016    -.0705474   -.0072873
       2003  |  -.0352981   .0160569    -2.20   0.028     -.066769   -.0038271
       2004  |  -.0165621   .0160734    -1.03   0.303    -.0480653    .0149411
       2005  |  -.0029547    .016015    -0.18   0.854    -.0343436    .0284341
       2006  |   -.007283   .0159477    -0.46   0.648      -.03854     .023974
       2007  |  -.0136835   .0159746    -0.86   0.392     -.044993    .0176261
       2008  |   -.023635   .0160035    -1.48   0.140    -.0550013    .0077313
       2009  |  -.0805072   .0159918    -5.03   0.000    -.1118505   -.0491638
       2010  |  -.0061198   .0160151    -0.38   0.702    -.0375089    .0252693
       2011  |  -.0100551   .0160297    -0.63   0.530    -.0414727    .0213624
       2012  |  -.0430638   .0160494    -2.68   0.007      -.07452   -.0116076
       2013  |  -.0678387   .0160696    -4.22   0.000    -.0993346   -.0363428
       2014  |  -.0558853   .0161143    -3.47   0.001    -.0874687    -.024302
       2015  |  -.0535134   .0160658    -3.33   0.001    -.0850019   -.0220249
       2016  |  -.0501613   .0160952    -3.12   0.002    -.0817073   -.0186153
       2017  |  -.0303964    .016162    -1.88   0.060    -.0620733    .0012804
       2018  |  -.0442285   .0161004    -2.75   0.006    -.0757848   -.0126722
       2019  |  -.0549213    .016123    -3.41   0.001    -.0865217   -.0233208
             |
       _cons |  -.0994745   .2230742    -0.45   0.656    -.5366918    .3377428
-------------+----------------------------------------------------------------
         rho |   .3502929
------------------------------------------------------------------------------

. 
. eststo clear

. quietly eststo:xtpcse lngdp lntot i.year if abs(r)<=4, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 i.year if abs(r)<=4, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lntariff i.year if abs(r)<=4, het corr(a
> r1)

. quietly eststo:xtpcse lngdp lntot lntot2 lntariff lnfdiout i.year if abs(r)<=4, h
> et corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lntariff lnfdiout lntropen i.year if abs
> (r)<=4, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving i.ye
> ar if abs(r)<=4, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpo
> p i.year if abs(r)<=4, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpo
> p lnhc i.year if abs(r)<=4, het corr(ar1)

. quietly eststo:xtpcse lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpo
> p lnhc L1.lngdp i.year if abs(r)<=4, het corr(ar1)

. esttab est1 est2 est3 est4 est5 est6 est7 est8 est9 using all.csv, star(* .10 ** 
> .05 *** .01) se stats(N r2) indicate("Year Dummies =*.year") replace
(file all.csv not found)
(output written to all.csv)

. 
. quietly eststo:xtpcse lngdp lntot lntot2 lntariff lnfdiout lntropen lnsaving grpo
> p lnhc L1.lngdp i.year  if abs(r1)<=4&oilprofit>=0.1, het corr(ar1)

. esttab est9 est10 using alloil.csv, star(* .10 ** .05 *** .01) se stats(N r2) ind
> icate("Year Dummies =*.year") replace
(file alloil.csv not found)
(output written to alloil.csv)

. 
. *8
. twoway (histogram tot if gdp > 40000,  title("Distribution of Term of Trade for R
> ich VS Poor Country") color(blue) lcolor(black))(histogram tot if gdp < 15000, co
> lor(red) lcolor(black)),legend(order(1 "Rich" 2 "Poor"))

. graph export tot.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/tot.png saved as PNG format

. 
. twoway (histogram tariff if gdp > 40000,  title("Distribution of tariff for Rich 
> VS Poor Country") color(blue) lcolor(black))(histogram tariff if gdp < 15000, col
> or(red) lcolor(black)),legend(order(1 "Rich" 2 "Poor"))

. graph export tariff.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/tariff.png saved as PNG
    format

. 
. twoway (histogram fdiout if gdp > 40000,  title("Distribution of FDI outflowfor f
> or Rich VS Poor Country") color(blue) lcolor(black))(histogram fdiout if gdp < 15
> 000, color(red) lcolor(black)),legend(order(1 "Rich" 2 "Poor"))

. graph export fdiout.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/fdiout.png saved as PNG
    format

. 
. twoway (histogram tropen if gdp > 40000,  title("Distribution of Trade Openness f
> or Rich VS Poor Country") color(blue) lcolor(black))(histogram tropen if gdp < 15
> 000, color(red) lcolor(black)),legend(order(1 "Rich" 2 "Poor"))

. graph export tropen.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/tropen.png saved as PNG
    format

. 
. *subset
. 
. twoway (histogram tot if oilprofit>=0.1,  title("Distribution of Term of Trade fo
> r Oil Producing Country VS All Country") color(blue) lcolor(black))(histogram tot
> , color(red) lcolor(black)),legend(order(1 "Oil" 2 "All"))

. graph export totoil.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/totoil.png saved as PNG
    format

. 
. twoway (histogram tariff if oilprofit>=0.1,  title("Distribution of tariff for Oi
> l Producing Country VS All Country") color(blue) lcolor(black))(histogram tariff,
>  color(red) lcolor(black)),legend(order(1 "Oil" 2 "All"))

. graph export tariffoil.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/tariffoil.png saved as PNG
    format

. 
. twoway (histogram fdiout if oilprofit>=0.1,  title("Distribution of FDI outflowfo
> r for Oil Producing Country VS All Country") color(blue) lcolor(black))(histogram
>  fdiout, color(red) lcolor(black)),legend(order(1 "Oil" 2 "All"))

. graph export fdioutoil.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/fdioutoil.png saved as PNG
    format

. 
. twoway (histogram tropen if oilprofit>=0.1,  title("Distribution of Trade Opennes
> s for Oil Producing Country VS All Country") color(blue) lcolor(black))(histogram
>  tropen, color(red) lcolor(black)),legend(order(1 "Oil" 2 "All"))

. graph export tropenoil.png, replace
file /Users/czh/Documents/ECON 490/Econometric file/tropenoil.png saved as PNG
    format

. 
. *close log file
. log close
      name:  <unnamed>
       log:  /Users/czh/Documents/ECON 490/Econometric file/Econometric File.log
  log type:  text
 closed on:  16 Apr 2022, 19:51:38
-----------------------------------------------------------------------------------
